[{"id":"e777ee9e-2257-11e8-85a4-204b1c34793d","created_at":"Wed Mar 07 22:36:19 UTC 2018","title":"Staff Site Reliability Engineer ","location":"Remote","type":"Full Time","description":"<p>CircleCI is seeking a Staff Site Reliability Engineer to work closely with our Software Engineers to deliver and manage the high-performance and scalable infrastructure underlying our multi-tenant Cloud offering as well as our Server-installed, on-premises solution. You will not only have the chance to automate and optimize infrastructure through the construction of appropriate tooling, but you will help software engineers through the design phase to optimize their services for scale in our production environment.</p>\n\n<p>The CircleCI SRE team is globally distributed and remote-friendly. We take advantage of multiple timezones to manage a platform for our global customer base.</p>\n\n<p><b>About CircleCI</b></p>\n\n<ul>Velocity is critical for software teams in today's competitive landscape, but maintaining speed can be difficult as apps and systems grow larger and more complex. CircleCI’s platform allows developers to rapidly release code (for web and mobile apps) they trust by automating the build, test, and deploy process. CircleCI enables developers to detect and fix bugs before they even reach customers. Thousands of leading companies including Facebook, Kickstarter, Shyp and Spotify rely on CircleCI to accelerate delivery of their code and enable developers to focus on creating business value fast.</ul><p>CircleCI is a Bay Area Best Places to Work 2016 award winner. Founded in 2011 and headquartered in beautiful downtown San Francisco with a global remote workforce, CircleCI is venture backed by Scale Venture Partners, DFJ, Baseline Ventures and Harrison Metal Capital.</p>\n\n<p><b>What will make you successful:</b></p>\n\n<ul>\n<li>Experience managing a container-based microservice architecture, including orchestration, service-discovery, monitoring, and debugging</li>\n<li>Understanding of standard networking protocols and components such as: TCP/IP, HTTP, DNS, ICMP, the OSI Model, Subnetting, and Load Balancing</li>\n<li>In-depth knowledge of operating systems (processes, threads, IPC, concurrency, locks, mutexes, semaphores, etc.)</li>\n<li>Proficiency in one or more of: C, C++, Java, Python, Go</li>\n<li>Comprehensive knowledge of the internal workings of at least one of Postgres, Mongo, Redis</li>\n<li>Systematic problem solving approach, coupled with a strong sense of ownership and drive</li>\n<li>Track-record of working cooperatively with software engineering teams</li>\n<li>Focus on security in the delivery of all levels of a system</li>\n<li>Passion for modern software development and operation, including agile, CI/CD, and infrastructure-as-code</li>\n<li>Desire to learn and grow</li>\n<li>6+ years of experience</li>\n</ul><p><b>What you will do:</b></p>\n\n<ul>\n<li>Design and deliver solutions to improve the availability, scalability, latency, and efficiency of CircleCI’s services</li>\n<li>Engage in service capacity planning and demand forecasting, anticipating performance bottlenecks</li>\n<li>Diagnose and resolve production issues in conjunction with software engineering teams</li>\n<li>Architect and implement shared infrastructure used by all services within the CircleCI platform, for both SaaS and on-prem configurations</li>\n<li>Support and advise software engineering teams in the design of scalable services</li>\n<li>Build and maintain tools for deployment, monitoring, and debugging</li>\n<li>Plan and execute disaster recovery drills</li>\n<li>Participate in rotating on-call duties, including incident management</li>\n</ul><p>If you’re interested in joining the team at CircleCI, please send a resumé and let us know why you’d be a great fit for our team. If you contribute to an open source project, write a blog, or have a presence on the web (Twitter, GitHub, LinkedIn, etc.) we would love to hear about it.</p>\n\n<p>We care deeply about diversity and inclusivity. We’re hiring at all experience levels, and seek talented teammates from a wide variety of backgrounds and experiences who are equally committed to cultivating a work environment of respect and kindness. We carefully consider every applicant that takes the time to apply.</p>","how_to_apply":"<p><a href=\"https://jobs.lever.co/circleci/95b219a8-b490-4be0-9f03-daf40f00370f?lever-origin=applied&amp;lever-source%5B%5D=GITHUB\">https://jobs.lever.co/circleci/95b219a8-b490-4be0-9f03-daf40f00370f?lever-origin=applied&amp;lever-source%5B%5D=GITHUB</a></p>","company":"CircleCI","company_url":"http://www.circleci.com ","company_logo":"http://github-jobs.s3.amazonaws.com/e31a24d4-2257-11e8-8ff4-dccd85004d2c.jpg","url":"http://jobs.github.com/positions/e777ee9e-2257-11e8-85a4-204b1c34793d"},{"id":"c112318a-2255-11e8-8cce-e90daf02d1e2","created_at":"Wed Mar 07 22:20:54 UTC 2018","title":"Principal Software Engineer ","location":"Remote Or San Francisco ","type":"Full Time","description":"<p>CircleCI is looking for an experienced engineering leader to help us guide the evolution of our platform architecture. In this role, you will work with the entire Engineering organization to help cross-functional teams create designs that fit their business and technical needs while ensuring architectural consistency.</p>\n\n<p>At CircleCI you will be working with a team who values trust, respect, and diversity. We are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are remote-friendly, and are looking for people who are passionate about helping shape software engineering best practices for the industry as a whole. While we can support a remote role anywhere you also have the option to work out of our Toronto or San Francisco office.</p>\n\n<p>To thrive in this role you are someone who works well in teams and enjoys collaborating. Furthermore, you understand the business impact of your code and enjoy incorporating the business objectives into your approach to development. You enjoy working with Product to find the best solution to the problem at hand, and can balance technical tradeoffs with delivering customer value quickly and iteratively.</p>\n\n<p><b>About CircleCI</b></p>\n\n<ul>Velocity is critical for software teams in today's competitive landscape, but maintaining speed can be difficult as apps and systems grow larger and more complex. CircleCI’s platform allows developers to rapidly release code (for web and mobile apps) they trust by automating the build, test, and deploy process. CircleCI enables developers to detect and fix bugs before they even reach customers. Thousands of leading companies including Facebook, Kickstarter, Shyp and Spotify rely on CircleCI to accelerate delivery of their code and enable developers to focus on creating business value fast.</ul><p><b>About this role:</b></p>\n\n<ul>\n<li>Map technology trends into technical requirements</li>\n<li>Evaluate products and make buy vs build decisions</li>\n<li>Coach/train teams on complex technical subjects</li>\n<li>Scope initiatives based on high-level product conversations</li>\n<li>Shape how we design, release, and maintain microservices</li>\n<li>Work closely with Product to ensure delivery of high value customer facing features</li>\n<li>Work on cross-functional, feature-driven engineering teams</li>\n</ul><p><b>You have:</b></p>\n\n<ul>\n<li>Experience designing across architectural styles to fit the needs of the business</li>\n<li>Deep understanding of modern software development, including agile, CI/CD, and infrastructure-as-code</li>\n<li>Strong understanding of the business impact of your work</li>\n<li>Experience with microservice architectures</li>\n<li>Experience with functional programming</li>\n<li>10+ years of development experience</li>\n<ul>\n<b>You Enjoy:</b>\n<ul>\n<li>Working in a highly collaborative environment</li>\n<li>Supporting an environment that values trust, respect, and diversity</li>\n<li>Exploring different methods for efficiently delivering code and customer value</li>\n<li>Delivering value to customers</li>\n<li>Sharing your expertise and encouraging best practices</li>\n</ul>\n<p>CircleCI is a Bay Area Best Places to Work 2016 award winner. Founded in 2011 and headquartered in beautiful downtown San Francisco with a global remote workforce, CircleCI is venture backed by Scale Venture Partners, DFJ, Baseline Ventures and Harrison Metal Capital. </p>\n\n<p>We care deeply about diversity and inclusivity. We’re hiring at all experience levels, and seek talented teammates from a wide variety of backgrounds and experiences who are equally committed to cultivating a work environment of respect and kindness. We carefully consider every applicant that takes the time to apply.</p>\n</ul>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/circleci/2d3dfa95-042c-48df-abb3-4fffae70bc31?lever-origin=applied&amp;lever-source%5B%5D=GITHUB\">https://jobs.lever.co/circleci/2d3dfa95-042c-48df-abb3-4fffae70bc31?lever-origin=applied&amp;lever-source%5B%5D=GITHUB</a></p>","company":"CircleCI","company_url":"http://www.circleci.com ","company_logo":"http://github-jobs.s3.amazonaws.com/e31a24d4-2257-11e8-8ff4-dccd85004d2c.jpg","url":"http://jobs.github.com/positions/c112318a-2255-11e8-8cce-e90daf02d1e2"},{"id":"a5ad0732-224e-11e8-9651-0d8b3631ae8a","created_at":"Wed Mar 07 21:30:27 UTC 2018","title":"Database Engineer / Optimization / Implementations","location":"Palo Alto","type":"Part Time","description":"<p>We are hiring for a part-time or full-time database engineer to join our Palo Alto team.</p>\n\n<p>Job description</p>\n\n<p>ClearAccessIP team is looking for a strong database engineer to join our team to enable us to grow our data-driven, high impact analytics and data management offering. If you are data curious, excited about deriving insights from data, and motivated by having impact on the business, we want to hear from you.</p>\n\n<p>As a database and dev ops engineer, you would be responsible for:</p>\n\n<ul>\n<li>Building, deploying and monitoring our environment servers</li>\n<li>Implementing and optimizing statistical and deep learning models on large datasets,</li>\n<li>Database maintenance and optimization</li>\n</ul><p>Required Qualifications</p>\n\n<ul>\n<li>Strong experience with one or more of the following technologies: Java, Python, Shell Scripting, PostgreSQL/MySQL, MongoDB</li>\n<li>Experience with web servers (Apache, Tomcat, etc)</li>\n<li>Experience with AWS services e.g., S3, EC2</li>\n</ul><p>Bonus!</p>\n\n<ul>\n<li>For the right candidate, be hire #10 and join our 2015 stock option plan after 90 days.</li>\n<li>we cover lunch every work day on the food-filled California Ave in Palo Alto.</li>\n<li>Technical advisors from the top professors in machine learning</li>\n<li>$2800 conference stipend</li>\n<li>the top healthcare California has to offer (UnitedHealth Gold Plus Plan)</li>\n<li>$250/month health and wellness stipend</li>\n<li>Reasonable work schedule for a start-up (our average engineer arrives to work at 10am)</li>\n<li>light-filled office surrounded by trees</li>\n</ul><p>We are hiring quickly, so be sure to reach out if you're interested!</p>","how_to_apply":"<p>Email resume and two references to: <a href=\"mailto:nicole@clearaccessip.com\">nicole@clearaccessip.com</a></p>","company":"ClearAccessIP","company_url":"http://ClearAccessIP","company_logo":null,"url":"http://jobs.github.com/positions/a5ad0732-224e-11e8-9651-0d8b3631ae8a"},{"id":"eb9213a4-224a-11e8-85b5-d4f690b54121","created_at":"Wed Mar 07 21:03:50 UTC 2018","title":"DevOps engineer at intersection of information security and cryptocurrency","location":"Remote","type":"Full Time","description":"<h2>Job description</h2>\n\n<p><a href=\"https://chorus.one/\">Chorus One</a> builds and operates infrastructure for emerging cryptocurrency and blockchain networks. Our products will help token holders make returns and shape the evolution of decentralized cryptocurrency networks.</p>\n\n<p>The first product is a validator for the Proof-of-Stake <a href=\"https://cosmos.network/\">Cosmos network</a>. In the medium term, we will operate nodes and run infrastructure on various other cryptocurrency networks.</p>\n\n<p>We are hiring a full-time DevOps engineer to implement and maintain production infrastructure.. This position is a unique opportunity to work with a very experienced team on cutting-edge blockchain networks and information security.</p>\n\n<h3>Responsibilities:</h3>\n\n<ul>\n<li>Design, implement and maintain production systems for cryptocurrency validators. Systems are expected to incorporate signing servers, test networks, validating servers, relaying nodes, key security solutions, monitoring tools and administration tools.</li>\n<li>Implement security policies to ensure that production systems are hardened against external attack.</li>\n<li>Develop a continuous integration and testing pipeline to automatically test and upgrade code bases powering test networks and production validators.</li>\n<li>Setup and operate a Kubernetes and/or Docker Swarm cluster on production and test networks.</li>\n<li>Harden Linux hosts via HIDS policies (e.g., apparmor, SELinux).</li>\n</ul><h3>The ideal candidate:</h3>\n\n<ol>\n<li>Is able to work independently</li>\n<li>Has prior work experience in a medium sized company or as a DevOps lead in a startup</li>\n<li>Knowledge of AWS, continuous integration and automated deployment</li>\n<li>Good knowledge of security as it relates to cloud based infrastructure</li>\n<li>Experience using automated monitoring tools</li>\n<li>Experience scaling containers both horizontally and vertically.</li>\n<li>Experience working with firewalls, intrusion prevention and intrusion detection systems</li>\n<li>Bachelor’s or advanced degree in computer science is a plus,but not strictly needed.</li>\n</ol><h3>We offer:</h3>\n\n<ul>\n<li>Competitive salary (70k-110k per year) + equity.</li>\n<li>5 weeks annual leave.</li>\n<li>Full-time position.</li>\n<li>Location: Remote, Los Angeles or Berlin.</li>\n<li>Work on cool technology and interesting problems at the intersection of finance, cryptocurrency, information security and blockchain networks.</li>\n</ul>","how_to_apply":"<p>To apply, send your resume with an introductory email to: [meher]at the rate[chorus]dot[one]</p>","company":"Chorus One","company_url":"https://chorus.one/","company_logo":"http://github-jobs.s3.amazonaws.com/a72a0c76-224a-11e8-85c2-d62275ca4d68.jpg","url":"http://jobs.github.com/positions/eb9213a4-224a-11e8-85b5-d4f690b54121"},{"id":"86dd462c-2240-11e8-95a9-cd9df51db7fc","created_at":"Wed Mar 07 19:51:31 UTC 2018","title":"Systems Analyst/Programmer, Libraries Information Technology ","location":"New York, NY","type":"Full Time","description":"<p>Columbia University Libraries seeks a motivated and collaborative Systems Analyst/Programmer to join the Libraries Information Technology (LIT) division. \nUnder general supervision, develops specifications and requirements for database applications in support of library programs; programs, enhances, modifies, and expands new and existing database applications and related programs; installs and integrates vendor-supplied database applications. \nDetailed responsibilities include but are not limited to: </p>\n\n<ul>\n<li>programming, debugging, and documenting complex software applications, including batch interface properties for database applications.</li>\n<li>consulting with Libraries staff to develop application functional requirements, conducting data analyses and preparing specifications.</li>\n<li>preparing program design descriptions, models and prototypes, modifying specifications to improve design and functionality, in consultation with other technical staff.</li>\n<li>managing security policies, access permissions, and disaster recovery for mission-critical data on servers and desktop systems.</li>\n<li>installing and integrating vendor-supplied database applications.</li>\n<li>acting as a resource and consultant to staff involved in related projects and performing other duties as assigned.\nAs one of the world's leading research universities, Columbia University in the City of New York provides outstanding opportunities to work and grow in a dynamic multicultural intellectual community. The Columbia University Libraries comprises a diverse, collegial and engaged staff committed to furthering the University’s teaching and research mission through innovation, leadership, collaboration and professionalism.</li>\n</ul><p>Minimum Qualifications: </p>\n\n<ul>\n<li>Bachelor's degree and a minimum three years’ related experience or the equivalent combination of education and experience.</li>\n<li>Experience in progressive analysis and programming.</li>\n<li>Development experience in UNIX.</li>\n<li>Proficiency in one or more appropriate application development languages (such as perl, PHP, python, ruby). </li>\n<li>Development experience in MySQL, Oracle, and/or Microsoft SQL environments. </li>\n<li>Familiarity with the design and programming of relational database applications. </li>\n<li>Familiarity with MARC, JSON, XML</li>\n<li>Ability to perform systems analysis and programming independently, under general direction. </li>\n<li>Strong verbal and written communication skills. </li>\n<li>Must be able to balance priorities and meet deadlines on multiple tasks.</li>\n<li>Commitment to supporting and working in a diverse environment.\nPreferred Qualifications: </li>\n<li>Previous experience with automation applications in a library environment strongly preferred.</li>\n</ul><p>Submit an application on-line at <a href=\"https://jobs.columbia.edu/applicants/Central?quickFind=167631\">https://jobs.columbia.edu/applicants/Central?quickFind=167631</a></p>\n\n<p>Columbia University is an Equal Opportunity/Affirmative Action employer and strongly encourages individuals of all backgrounds and cultures to consider this position.</p>","how_to_apply":"<p>Submit an application on-line at <a href=\"https://jobs.columbia.edu/applicants/Central?quickFind=167631\">https://jobs.columbia.edu/applicants/Central?quickFind=167631</a></p>","company":"Columbia University","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/86dd462c-2240-11e8-95a9-cd9df51db7fc"},{"id":"2b37598a-223f-11e8-9f23-22626a83af7b","created_at":"Wed Mar 07 19:39:44 UTC 2018","title":"Systems Engineer, Libraries Information Technology ","location":"New York, NY","type":"Full Time","description":"<p>Columbia University Libraries seeks a motivated and collaborative Systems Engineer to join the Unix Systems Group in the Libraries Information Technology (LIT) division. \nReporting to the Senior Systems Engineer, the Systems Engineer will design, develop and deploy Unix server and storage systems and perform maintenance and security updates as required. Additionally, the incumbent will document and provide support for a variety of innovative projects and services within the Libraries as well as collaborate on specialized projects with various departments across the organization as needed. \nDetailed responsibilities include but are not limited to: </p>\n\n<ul>\n<li>Designing, installing, documenting, monitoring, optimizing, and maintaining Linux (primarily CentOS) servers.</li>\n<li>Monitoring, troubleshooting, and documenting some Linux servers maintained by CUIT.</li>\n<li>Modifying, testing, implementing, troubleshooting, and documenting both vendor-supplied and in-house applications on servers.</li>\n<li>Managing security policies, access permissions and disaster recovery for mission-critical data on servers and desktop systems.</li>\n<li>Collaborating on projects and related activities with other units, Columbia University IT (CUIT), other schools and departments at Columbia, and outside institutions.</li>\n<li>Performing other duties as assigned.</li>\n</ul><p>As one of the world's leading research universities, Columbia University in the City of New York provides outstanding opportunities to work and grow in a dynamic multicultural intellectual community. The Columbia University Libraries comprises a diverse, collegial and engaged staff committed to furthering the University’s teaching and research mission through innovation, leadership, collaboration and professionalism.</p>\n\n<p>Minimum Qualifications: </p>\n\n<ul>\n<li>Bachelor's degree and a minimum three years’ related experience or the equivalent combination of education and experience.</li>\n<li>Knowledge of Unix/Linux environment. </li>\n<li>Strong verbal and written communication skills. </li>\n<li>Knowledge of programming principles and at least one higher-level programming language. </li>\n<li>Must be able to balance priorities and meet deadlines on multiple tasks.</li>\n<li>Commitment to supporting and working in a diverse environment.\nPreferred Qualifications: </li>\n<li>Experience with CentOS, cloud services (AWS), virtualization (xen, vmware), configuration management (Saltstack, Ansible), Python, relational databases, storage management, source control (git), web services (nginx/apache, haproxy, varnish).</li>\n</ul><p>Submit an application on-line at <a href=\"https://jobs.columbia.edu/applicants/Central?quickFind=167618\">https://jobs.columbia.edu/applicants/Central?quickFind=167618</a></p>\n\n<p>Columbia University is an Equal Opportunity/Affirmative Action employer and strongly encourages individuals of all backgrounds and cultures to consider this position.</p>","how_to_apply":"<p>Submit an application on-line at <a href=\"https://jobs.columbia.edu/applicants/Central?quickFind=167618\">https://jobs.columbia.edu/applicants/Central?quickFind=167618</a></p>","company":"Columbia University","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/2b37598a-223f-11e8-9f23-22626a83af7b"},{"id":"ec87c89a-2226-11e8-9bf3-5cd6ba847102","created_at":"Wed Mar 07 16:45:39 UTC 2018","title":"UI Developer Front End (AngularJS)","location":"San Francisco, CA","type":"Full Time","description":"<p>Company Description</p>\n\n<p>Vlocity is a fast-growing enterprise applications company focused on bringing industry-specific business processes to the cloud. With 300 employees around the world and customers on six continents, Vlocity has been the fastest-growing independent software vendor on the Salesforce platform for two years running. Vlocity is currently shipping version 15 of its application suite, and has raised over $100MM in capital from investors including Salesforce.com, Accenture and Sutter Hill Ventures.</p>\n\n<p>Vlocity develops software to help communications, media &amp; energy providers, insurance carriers and government agencies digitally engage customers through their channels and devices of choice. We serve dozens of the world’s Fortune 5000 companies including Sky Italia, Telecom Italia, TELUS, 3, Telecom Argentina, Cellcom, New York Life, Farmers Insurance, Harvard Pilgrim, and Anthem. Our solutions run on our customers’ web sites, in their contact centers and on the mobile devices of their service and sales professionals – providing a compelling, modern, omnichannel experience. Despite the complexity and sophistication of the enterprise business processes we enable, we believe the user experience should be as simple and compelling as a consumer application.</p>\n\n<p>Job Description</p>\n\n<p>Vlocity Inc is picking up speed and looking to expand its Customer Success team by hiring talented and enthusiastic UI Developers.</p>\n\n<p>In the cloud, presentation is definitely king. Our customers expect easy-to-use applications that drive down agent handling times, enhance the user experience and integrate seamlessly with their other systems and tools.</p>\n\n<p>And that’s where you come in! You’ll help us bring the ‘wow factor’ to our customer deployments - enhancing the native UI of the Vlocity product to deliver user friendly, innovative and beautiful web and mobile apps that are tailored and branded for the specific customer.</p>\n\n<p>Leveraging the powerful capabilities of the Vlocity toolkit, as well as the increasing palette of web development tools, you’ll be responsible for designing and implementing front-end functional deliverables that are highly usable, scalable, extensible, and maintainable.</p>\n\n<p>You will be working closely with the customer to optimize and customize their UI flows, web design and front end development.</p>\n\n<p>And you’ll be working with our Product and Engineering teams to help them drive innovation into future releases of Vlocity products.</p>\n\n<p>Qualifications</p>\n\n<ul>\n<li><p>You’ll have 3+ years’ experience of working on deployment teams, ideally using Agile development techniques.</p></li>\n<li><p>You’ll have a proven track record of customer-centric development, with an emphasis on delivery</p></li>\n<li><p>You’ll be passionate about developing apps that are both eye-catching and intuitive</p></li>\n<li><p>Ideally, you will have extensive experience of building applications in at least one of our industries - telecommunications, media, insurance, healthcare or public sector.</p></li>\n<li><p>You’ll be a self-starter, adept at picking up new skills and technologies, and eager to break new ground.</p></li>\n<li><p>You’ll have excellent communication skills, equally comfortable with crafting emails as leading a white-board discussion with customers, or delivering a functional demo</p></li>\n<li><p>You’ll have the vision to help us take our company to the next level.</p></li>\n</ul><p>Technical Skills</p>\n\n<ul>\n<li><p>AngularJS</p></li>\n<li><p>HTML5, CSS3, JavaScript and more</p></li>\n<li><p>Salesforce (Visualforce, Apex, Lightning)</p></li>\n<li><p>Desired Certifications / Qualifications</p></li>\n<li><p>Bachelors or Masters degree in Computer Science, Software Engineering or a related field</p></li>\n<li><p>Salesforce Platform Developer / Platform App Builder</p></li>\n</ul>","how_to_apply":"<p>Apply directly through our jobs page at: <a href=\"https://grnh.se/3j1b7j8o1\">https://grnh.se/3j1b7j8o1</a></p>","company":"Vlocity","company_url":"https://www.vlocity.com","company_logo":"http://github-jobs.s3.amazonaws.com/d5227984-2226-11e8-8f9c-918baba618c4.jpg","url":"http://jobs.github.com/positions/ec87c89a-2226-11e8-9bf3-5cd6ba847102"},{"id":"dbfc02f2-fd77-11e3-9627-a101934ea25e","created_at":"Wed Mar 07 16:13:10 UTC 2018","title":"Senior Web Applications Engineer (Rails+)","location":"San Francisco","type":"Full Time","description":"<p>As a Senior full-stack engineer at Sharethrough you’ll build out our native monetization software suite used by top publishers to connect with brands on the open web, powering critical revenue behind companies like Disney, CNN, VICE, and CBSi.  We believe that advertising can be better and you'll help make that happen.  You'll be a key contributor to our Rails-based server side platform and multiple backend integrations that interface with systems varying from ad serving to data warehousing.</p>\n\n<p><strong>What You'll Be Doing</strong></p>\n\n<ul>\n<li>\n<strong>Having a say:</strong> You’ll participate in the problem definition and solution process with a diverse group of engineers, designers and business owners from around the company.</li>\n<li>\n<strong>Proper engineering:</strong> Writing Rails and JS that is performant, well-tested, and easy to maintain.</li>\n<li>\n<strong>Technical heavy lifting:</strong> You’ll architect and implement major components of an ambitious technical roadmap.</li>\n<li>\n<strong>Deploying code on your first day:</strong> We push to production on every commit via our continuous integration and deployment pipeline.</li>\n</ul><p><strong>Let's Talk If</strong></p>\n\n<ul>\n<li>\n<strong>You’ve shipped software:</strong> You have production experience with a nice bit of our stack: Ruby, Rails, Sidekiq, React, Node.js, etc. and for the parts you don’t, you’re excited to learn.</li>\n<li>\n<strong>You care about code:</strong> You take pride in development, and have a deep understanding of how to write high quality, maintainable, extensible software.</li>\n<li>\n<strong>You want to derive meaning from what you do:</strong> Every engineer here is excited to understand what problem they’re solving, why they’re solving it and who they’re solving it for.</li>\n</ul><p><strong>Why You'll Love Working at Sharethrough</strong></p>\n\n<ul>\n<li>\n<strong>Values-driven culture:</strong> You’d be walking into a welcoming and diverse environment that is built around action, optimism, purpose and transparency.  We have a fun, supportive culture, and firmly believe in what we’re doing.</li>\n<li>\n<strong>Marry the problem, not the solution:</strong> We’re constantly re-evaluating our technical infrastructure to deliver faster, better, and more reliable software.</li>\n<li>\n<strong>Twenty percent time:</strong> One day a week you’ll have the opportunity to dig deeper and explore new technologies, frameworks, etc. This is time set aside for you and the team as an investment in you, and you’ll have the chance to exchange learnings with your team.</li>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/sharethrough/bf13c994-3a3f-4981-af51-45961497af30/apply?lever-source=Github\">https://jobs.lever.co/sharethrough/bf13c994-3a3f-4981-af51-45961497af30/apply?lever-source=Github</a></p>","company":"Sharethrough","company_url":"http://Sharethrough","company_logo":"http://github-jobs.s3.amazonaws.com/e0508206-6bc1-11e5-89ca-4c0b59d838c7.png","url":"http://jobs.github.com/positions/dbfc02f2-fd77-11e3-9627-a101934ea25e"},{"id":"01e73658-2222-11e8-9d65-a99426a7533d","created_at":"Wed Mar 07 16:10:28 UTC 2018","title":"Software Engineer - Fullstack","location":"Bengaluru, India","type":"Full Time","description":"<p>Company Description</p>\n\n<p>Vlocity is a fast-growing enterprise applications company focused on bringing industry-specific business processes to the cloud. With 300 employees around the world and customers on six continents, Vlocity has been the fastest-growing independent software vendor on the Salesforce platform for two years running. Vlocity is currently shipping version 15 of its application suite, and has raised over $100MM in capital from investors including Salesforce.com, Accenture and Sutter Hill Ventures.</p>\n\n<p>Vlocity develops software to help communications, media &amp; energy providers, insurance carriers and government agencies digitally engage customers through their channels and devices of choice. We serve dozens of the world’s Fortune 5000 companies including Sky Italia, Telecom Italia, TELUS, 3, Telecom Argentina, Cellcom, New York Life, Farmers Insurance, Harvard Pilgrim, and Anthem. Our solutions run on our customers’ web sites, in their contact centers and on the mobile devices of their service and sales professionals – providing a compelling, modern, omnichannel experience. Despite the complexity and sophistication of the enterprise business processes we enable, we believe the user experience should be as simple and compelling as a consumer application.</p>\n\n<p>Job Description</p>\n\n<p>Vlocity, Inc. is recruiting full stack application developers to join our fast growing startup. These developers will have the unique opportunity to shape and create Vlocity's vertical apps from the ground up built on the Salesforce Platform.</p>\n\n<p>As an early developer, you will be responsible for designing and implementing product requirements that are highly usable, scalable, extensible, and maintainable, in large part on the Force.com platform. You will work in a highly agile environment, with product managers, engineers and customers, as well as with our leadership team, using iterative and test-driven design methods.</p>\n\n<p>You will be developing modern, web-based applications for the Salesforce1 Platform using Visualforce, Apex, Javascript, HTML/CSS, and other technologies. An understanding of relational &amp; NoSql databases is a plus.</p>\n\n<p>We are going to build our industry apps on modern technology stacks. Force.com and Salesforce1 will be our cloud-based CRM platform. We will add additional technology stacks as needed and you'll be part of that analysis and development process.</p>\n\n<p>Responsibilities</p>\n\n<ul>\n<li><p>Design and develop products in Visualforce, Apex, SalesForce1, Javascript, HTML/CSS, and related technologies.</p></li>\n<li><p>Object and entity modelling on Force.com platform.</p></li>\n<li><p>Write create clean, effective code for simple or complex user tasks.</p></li>\n<li><p>Work in an agile, rapid development and prototyping environment where effective communication is paramount.</p></li>\n<li><p>Contribute to building a positive, can-do, high-performance culture.Experience with Force.com and the SalesForce1 platform is a plus. </p></li>\n</ul><p>Experience</p>\n\n<ul>\n<li><p>3+ years of experience in software development.</p></li>\n<li><p>Experience with Force.com and the SalesForce1 platform is a plus.</p></li>\n<li><p>Experience building web-based user interfaces, with a deep understanding of HTML, Javascript, and CSS.</p></li>\n<li><p>Experience with and knowledge of relational databases.</p></li>\n<li><p>Experience and desire to work within a fast-paced, iterative development environment</p></li>\n<li><p>Experience with Agile development is a strong plus.</p></li>\n</ul><p>Technical Skills</p>\n\n<ul>\n<li><p>Excellent understanding of Object-Oriented Programming patterns &amp; experience with OO languages (Java, Ruby, Python, Scala etc) </p></li>\n<li><p>Familiarity with JavaScript libraries such as jQuery, AngularJS, Backbone  </p></li>\n<li><p>Desired Certifications / Qualifications</p></li>\n<li><p>Stellar academic background</p></li>\n<li><p>Bachelor degree in computer science or similar engineering discipline </p></li>\n</ul>","how_to_apply":"<p>Apply directly through our jobs page at: <a href=\"https://grnh.se/cijut1me1\">https://grnh.se/cijut1me1</a></p>","company":"Vlocity","company_url":"https://www.vlocity.com","company_logo":"http://github-jobs.s3.amazonaws.com/fc87ecf2-2221-11e8-853f-63848354227a.jpg","url":"http://jobs.github.com/positions/01e73658-2222-11e8-9d65-a99426a7533d"},{"id":"789a0fc0-2220-11e8-835a-1040cfa3eee9","created_at":"Wed Mar 07 16:00:01 UTC 2018","title":"Backend Software Engineer - Java","location":"Bucharest","type":"Full Time","description":"<p><strong>Company Description</strong></p>\n\n<p>At Netcentric, we come to work every day knowing we’re part of the solution to the most complex challenges brands have ever faced: digital transformation. Consumer expectation of brands is increasing in a world that is more connected and fast-paced.</p>\n\n<p>Netcentric is a dynamic and innovative service provider with a unique culture. We empower our employees to use their creativity, looking beyond tools and technology to unlock the full potential of the Adobe Experience Cloud, so that we can deliver visionary digital marketing solutions for the world’s most recognized brands.</p>\n\n<p>As part of the Cognizant Digital Business, we reap the benefits of combined expertise and access to multidisciplinary teams, forging ahead to become a leading customer experience player in Europe.</p>\n\n<p>Our teams are based in some of the world’s most exciting cities - in Zurich, Munich, Berlin, Frankfurt, Dresden, Barcelona, Bucharest, London and Amsterdam. In all of our offices, you will find a culture that embraces over 43 different nationalities. You will also find some amazing views, fancy kitchens and cozy breakout areas for a bit of rest and relaxation.</p>\n\n<p>And oh, did we mention that we empower employees to make meaningful decisions at work through Holacracy?</p>\n\n<p><strong>Job Description</strong>\n<strong>Who are we looking for?</strong></p>\n\n<p>We are looking for a Software Engineer who loves web development and loves working with open source frameworks. If you are a team player with a passion for Java, who is willing to develop and learn - keep on reading! Netcentric will feel like home to you if you like to work in a fun, multicultural environment and like to be challenged every day.</p>\n\n<p>Netcentric is powered by an international team of skilled, social people who are all about building innovative digital marketing solutions in the Adobe Experience Cloud. We are a responsive organization that enables everyone to take initiative and contribute to the success of our projects and the company through Holacracy. We focus on technology, delivering quality work and supporting our customers.</p>\n\n<p><strong>Qualifications</strong>\n<strong>What do we require?</strong></p>\n\n<ul>\n<li> Being a team player</li>\n<li> Deep knowledge and experience with Java based web projects (JEE, Servlets)</li>\n<li> Worked with building tools like Maven</li>\n<li> Version control tools, GIT knowledge </li>\n<li> Passionate about modern web technologies</li>\n<li> Experience developing RESTful Web Services</li>\n<li> Strong verbal and written English language skills</li>\n</ul><p><strong>What makes us smile when looking at your profile …</strong></p>\n\n<ul>\n<li> Hands-on experience with any kind of content management (including open source).</li>\n<li> Design patterns and clean code</li>\n<li> Open Source Frameworks especially Apache Felix, Apache Sling, Apache Jackrabbit</li>\n<li> Understanding of OSGi with Declarative Services</li>\n<li> Understanding of the HTTP protocol</li>\n<li> Knowledge of HTML, CSS and JavaScript ( ExtJS, jQuery and AngularJS)</li>\n<li> Experience with unit testing (TDD makes us even happier)</li>\n<li> Capacity to identify requirements and define technical solutions</li>\n<li> Task management, bug tracking, and wiki-based documentation tools like JIRA</li>\n<li> Additional language skills, including German or Spanish, would be an asset</li>\n<li> Eligibility to work within the EU and/or Switzerland</li>\n</ul><p><strong>Additional Information</strong></p>\n\n<p><strong>How we work:</strong></p>\n\n<ul>\n<li> A proactive mindset, ability to share our ideas and bring them to life\nEnthusiasm</li>\n<li> We have open minds always looking for continuous improvement</li>\n<li> We are not afraid of giving and receiving feedback</li>\n</ul><p><strong>at Netcentric you get:</strong></p>\n\n<ul>\n<li> Permanent contract</li>\n<li> Centrally located office in Timpuri Noi with great fitout and standing desks</li>\n<li> Flexible working hours and possibility of home office, respecting project needs</li>\n<li> Apple work equipment</li>\n<li> Customer base: large multinational companies</li>\n<li> International and dynamic team</li>\n<li> Travel to customers and other locations in alignment with project needs</li>\n<li> Private medical subscription</li>\n<li> Sponsored Gym Membership (WorldClass/ 7Card)</li>\n<li> Yearly travel insurance</li>\n<li> 2 days Onboarding in one of our NC Offices across Europe</li>\n<li> Off-site company events, including our annual company summit</li>\n<li> Daily delivered fresh fruits</li>\n<li> A large variety of drinks (coffee, water, natural soft drinks) at the office</li>\n<li> Training, certification and conference attendance based on personal development goals</li>\n<li> Micro Bonus system (bonus.ly)</li>\n<li> Vacation: 22 days + December 24th and 31st + 1 additional day per calendar year in the company (maximum 30 days/year)</li>\n<li> Sick days: 3 per year (days you are sick, at home, but do not need to bring a doctors note)</li>\n<li> Referral bonus</li>\n<li> Everyone has a voice, we are a Holacracy organization</li>\n</ul><p>And much more...!</p>","how_to_apply":"<p><a href=\"https://jobs.smartrecruiters.com/Netcentric/743999666875992-backend-software-engineer-java\">https://jobs.smartrecruiters.com/Netcentric/743999666875992-backend-software-engineer-java</a></p>","company":"Netcentric","company_url":"https://www.netcentric.biz/careers.html","company_logo":"http://github-jobs.s3.amazonaws.com/43c9d514-2220-11e8-948c-2aacabb234e7.png","url":"http://jobs.github.com/positions/789a0fc0-2220-11e8-835a-1040cfa3eee9"},{"id":"5c66b6fc-221e-11e8-81c4-db18d71eff9b","created_at":"Wed Mar 07 15:54:25 UTC 2018","title":"Senior Software Engineer - Python","location":"London","type":"Full Time","description":"<p>We are looking for a highly experienced Senior Software Engineer with strong commercial experience of Python to build and maintain our core Python based platforms and services, in particular Pole Star's market-leading Fin Tech/Reg Tech products. You'll work in a talented and interdisciplinary team, with a strong creative culture, and help us deliver high impact work. You will work closely with all facets in our Boston and London offices.</p>\n\n<p>Would you like to:</p>\n\n<ul>\n<li>       Design, build, test and document software and web applications in Python</li>\n<li>       Find and identify new opportunities to fine-tune and optimize applications' performance </li>\n<li>       Support formal Quality Assurance and resolve test defects</li>\n<li>       Create services and applications utilizing various programming languages </li>\n<li>       Identify production and non-production application issues</li>\n</ul><p>Would you like to work for an established, fun and interesting Company?:\nWe provide tracking and monitoring services to the global maritime industry from our headquarters in London, with other offices in the maritime hubs of Boston, Panama, Hong Kong, Singapore and Australia.\nWe run provide and manage data centres for 46 governments worldwide, we monitor 40,000 ships on behalf of 1,300 clients located in over 90 countries.\nPole Star continues to experience strong growth and sustained profitability. The company is among Britain’s fastest growing private technology companies and was ranked in The Sunday Times Tech Track 100 league table. We are a privately owned UK Company and have a multinational team of 100 people, fluent in over 24 languages.</p>\n\n<p>Skills &amp; requirements\nYour essential skills and experience:</p>\n\n<ul>\n<li>       Commercial experience working in a fast paced, Agile (Scrum or similar) software</li>\n<li>       development environment</li>\n<li>       Four or more years of solid commercial Python experience</li>\n<li>       JSON, REST, SOAP and RESTful Services and API’s</li>\n<li>       Database and SQL knowledge, PostgreSQL, Oracle, PostGIS,</li>\n<li>       Solid commercial Linux/Unix knowledge (Redhat/CentOS/Fedora)</li>\n<li>       Jenkins, CI integration</li>\n<li>       SQS, RabbitMQ, Redis experience</li>\n<li>       Experience in migrating/updating legacy systems (e.g. Python 2.x to 3)</li>\n<li>       A strong drive and interest to learn new technologies quickly</li>\n<li>       Bachelor’s or Master’s degree in Computer Science, Engineering, or related field</li>\n</ul><p>It would be ideal if you also had experience in: </p>\n\n<ul>\n<li>       Web development: HTML (HTML5 &amp; CSS) and XML/XSL</li>\n<li>       JIRA., other Atlassian products</li>\n<li>       Knowledge of Geo-Spatial technology or GeoServer</li>\n<li>       AWS, AWS RDS</li>\n<li>       Docker</li>\n</ul><p>Company Perks and Benefits:</p>\n\n<ul>\n<li>      Competitive Salary</li>\n<li>      3x salary life assurance cover</li>\n<li>      25 days annual leave + UK public holidays</li>\n<li>      5% Contributory pension scheme</li>\n<li>      Active professional development and opportunities to attend conferences here and abroad</li>\n<li>      Private Health Insurance</li>\n<li>      Dental Insurance</li>\n<li>      Refer a friend recruitment bonus scheme</li>\n<li>      Business expenses</li>\n<li>      Annual Season Ticket Loan for your commute</li>\n<li>      Subsidised Gym Membership</li>\n<li>      Childcare Vouchers</li>\n<li>      Daily fruit baskets and cold pressed juices</li>\n<li>      On-site yoga classes and 5-aside football</li>\n<li>      Annual health-checks<br>\n</li>\n<li>      Exclusive staff discount on shopping &amp; dining at Westfield, London W12</li>\n<li>      Discount online benefit portal, offering a wide range of discounts for high street retailers</li>\n<li>      Ability to buy and sell holidays</li>\n</ul>","how_to_apply":"<p>To apply, please, send your CV and introduction to <a href=\"mailto:recruitment@polestarglobal.com\">recruitment@polestarglobal.com</a>.</p>\n\n<p>Thank you.</p>","company":"Pole Star Space Applications","company_url":"https://www.polestarglobal.com/","company_logo":"http://github-jobs.s3.amazonaws.com/4388c24c-221e-11e8-8d92-574c93808f15.jpg","url":"http://jobs.github.com/positions/5c66b6fc-221e-11e8-81c4-db18d71eff9b"},{"id":"9c68803c-221e-11e8-93d0-8d63623cde3f","created_at":"Wed Mar 07 15:49:50 UTC 2018","title":"Expert Technical Quality Engineer","location":"Bucharest","type":"Full Time","description":"<p><strong>WHY DO WE LOVE COMING TO WORK EVERY DAY?</strong></p>\n\n<p>With over 10,000 superstars across 48 different countries globally, it is hard not to be inspired every single day.  At Finastra we celebrate in global knowledge sharing, diversity and an opportunity to make a difference for each other and for our customers.</p>\n\n<p>We are on a journey.  After bringing two global Fintech leaders together in June 2017, Finastra has truly recognized the opportunity and power we have, by combining our expertise, successes and passion together. Whether it is in a collaboration hub or innovating with colleagues across our global landscape, we are one team creating a network of talent and creativity in a stimulating environment, to do what we can to make a difference for our customers. </p>\n\n<p>Our people are leaders in their role and are always looking for new ways to help our customers grow, compete and optimize their business.  From a graduate Software Engineer to an experienced Sales Executive – we are looking for personal leadership and people with the appetite to understand the markets and customers we serve. We drive  innovation that challenges the status quo and feel proud of the positive differences that we make every day.  We recognize talent and provide a work environment where leaders can drive results, develop and grow their careers.\nSuccess is what you do, success is what we achieve, together.<br>\nThe future of Finance is open – combine your talents with Finastra opportunities to create an exciting career with us.</p>\n\n<p>For more information, visit Finastra.com</p>\n\n<p><strong>Required Skills &amp; Experience</strong></p>\n\n<ul>\n<li>Strong understanding of performance testing methodologies best practices</li>\n<li>Strong knowledge of scripting languages ( Powershell would be a plus)</li>\n<li>Good knowledge of Continues integration process and tools ( Jenkins would be a plus)</li>\n<li>Good knowledge of database technologies such as Oracle</li>\n<li>Strong knowledge of SQL</li>\n<li>Passionate about technologies and interested in testing &amp; testing tools</li>\n<li>Able to quickly understand new concepts</li>\n<li>Possess analytical thinking, be detail oriented and well-organized</li>\n<li>Be able to communicate effectively with persons holding different roles</li>\n<li>Act both as a team player and self-learner</li>\n<li>Good written and spoken English</li>\n<li>(nice to have) Experience in development and maintenance of automated software framework</li>\n<li>(nice to have) Experience with performance testing tools ( Load Runner , Jmeter)</li>\n<li>(nice to have) Experience with automation support (incident management)</li>\n<li>(nice to have) Experience in working with distributed version control systems like GIT</li>\n<li>(nice to have) Experience in a global working environment</li>\n</ul>","how_to_apply":"<p><a href=\"https://dh.wd3.myworkdayjobs.com/en-US/DHC/job/Bucharest-Romania/Expert-Technical-Quality-Engineer_REQ0218_0005509-1\">https://dh.wd3.myworkdayjobs.com/en-US/DHC/job/Bucharest-Romania/Expert-Technical-Quality-Engineer_REQ0218_0005509-1</a></p>","company":"Finastra","company_url":"https://www.finastra.com/careers","company_logo":"http://github-jobs.s3.amazonaws.com/865de188-221e-11e8-8579-75bee26ff356.png","url":"http://jobs.github.com/positions/9c68803c-221e-11e8-93d0-8d63623cde3f"},{"id":"d309d880-221d-11e8-9764-1d0ddc271618","created_at":"Wed Mar 07 15:40:57 UTC 2018","title":"Software Engineer","location":"San Francisco, CA","type":"Full Time","description":"<p>Company Description</p>\n\n<p>Vlocity is a fast-growing enterprise applications company focused on bringing industry-specific business processes to the cloud. With 300 employees around the world and customers on six continents, Vlocity has been the fastest-growing independent software vendor on the Salesforce platform for two years running. Vlocity is currently shipping version 15 of its application suite, and has raised over $100MM in capital from investors including Salesforce.com, Accenture and Sutter Hill Ventures.</p>\n\n<p>Vlocity develops software to help communications, media &amp; energy providers, insurance carriers and government agencies digitally engage customers through their channels and devices of choice. We serve dozens of the world’s Fortune 5000 companies including Sky Italia, Telecom Italia, TELUS, 3, Telecom Argentina, Cellcom, New York Life, Farmers Insurance, Harvard Pilgrim, and Anthem. Our solutions run on our customers’ web sites, in their contact centers and on the mobile devices of their service and sales professionals – providing a compelling, modern, omnichannel experience. Despite the complexity and sophistication of the enterprise business processes we enable, we believe the user experience should be as simple and compelling as a consumer application.</p>\n\n<p>Job Description</p>\n\n<p>Vlocity, Inc. is recruiting full stack application developers to join our fast growing team.</p>\n\n<p>You will be responsible for designing and implementing product requirements that are highly usable, scalable, extensible, and maintainable, in large part on the Salesforce platform. You will work in a highly agile environment, with product managers, engineers and customers, as well as with our leadership team, using iterative and test-driven design methods.</p>\n\n<p>You will be developing modern, web-based applications for the Salesforce Platform using Apex, Javascript, HTML/CSS, and other technologies. An understanding of relational databases is a plus.</p>\n\n<p>Responsibilities</p>\n\n<ul>\n<li><p>Stellar academic background, Bachelor degree or equivalent experience required, specializing in computer science or similar engineering discipline.</p></li>\n<li><p>Excellent understanding of data structures, object-oriented design patterns &amp; experience with OO languages like Java.</p></li>\n<li><p>Experience with and knowledge of relational databases.</p></li>\n<li><p>Experience with Force.com and the Salesforce platform is a plus.</p></li>\n<li><p>Experience and desire to work within a fast-paced, iterative development environment; experience with Agile development is a strong plus.</p></li>\n</ul><p>Experience</p>\n\n<ul>\n<li><p>Minimum 2 years experience developing software in a product environment. </p></li>\n<li><p>Experience with Force.com and the SalesForce1 platform is a plus.</p></li>\n<li><p>Experience building web-based user interfaces, with a deep understanding of HTML, Javascript, and CSS.</p></li>\n<li><p>Experience with and knowledge of relational databases.</p></li>\n<li><p>Experience and desire to work within a fast-paced, iterative development environment</p></li>\n<li><p>Experience with Agile development is a strong plus.</p></li>\n</ul><p>Technical Skills</p>\n\n<ul>\n<li><p>Excellent understanding of Object-Oriented Programming patterns &amp; experience with OO languages (Java, Ruby, Python, Scala etc) </p></li>\n<li><p>Familiarity with JavaScript libraries such as jQuery, AngularJS, Backbone  </p></li>\n<li><p>Desired Certifications / Qualifications</p></li>\n<li><p>Stellar academic background</p></li>\n<li><p>Bachelor degree in computer science or similar engineering discipline </p></li>\n</ul>","how_to_apply":"<p>Apply directly through our jobs page at: <a href=\"https://grnh.se/vfby440u1\">https://grnh.se/vfby440u1</a></p>","company":"Vlocity","company_url":"https://www.vlocity.com","company_logo":"http://github-jobs.s3.amazonaws.com/be1eef3c-221d-11e8-986d-6b78ac3ca414.jpg","url":"http://jobs.github.com/positions/d309d880-221d-11e8-9764-1d0ddc271618"},{"id":"a1c18f6c-221c-11e8-8e07-e1c3a27ca935","created_at":"Wed Mar 07 15:32:23 UTC 2018","title":"Mobile Principal Software Engineer","location":"Dallas, TX","type":"Full Time","description":"<p>CBRE is looking for a mobile principal software engineer with experience developing, architecting and implementing enterprise-level mobile solutions. This role includes both hands-on development as well as helping implement CBRE's broader mobile strategy. Most development is cross platform focused, using Xamarin, but may also include other development approaches as well as tools/languages.  </p>\n\n<p>RESPONSIBILITIES:</p>\n\n<p>The design and development of new mobile software or extensive software revisions. </p>\n\n<p>Participating in defining product requirements, creating high-level architectural specifications, ensuring feasibility, functionality, and integration with existing systems/platforms.</p>\n\n<p>Designing and tuning systems for scalability, performance, and high availability.\nWorking with strategic vendors to develop implementation strategies, best practices, and architectures.</p>\n\n<p>Working with and leading development teams on implementing methodologies and standard development practices.</p>\n\n<p>Coordinating and assigning tasks to co-workers within a work unit and/or project team.</p>\n\n<p>Assessing the quality of others' work products, performing peer reviews.\nParticipating on an agile scrum team.</p>\n\n<p>QUALIFICATIONS:</p>\n\n<p>BA/BS degree in Computer Science or related discipline or equivalent professional experience.\n5 - 7 years of experience with software development, design, and testing.</p>\n\n<p>2+ years developing and architecting enterprise mobile solutions.</p>\n\n<p>Proficient in Xamarin and C#, as well as other mobile libraries &amp; frameworks.</p>\n\n<p>Experience with HTML5, XML, JSON, and Web Services.</p>\n\n<p>Experience with mobile optimized/optimization frameworks, methods and tools (jQuery Mobile, ReactJS, Responsive Design, Single Page Applications).</p>\n\n<p>Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies.</p>\n\n<p>Excellent interpersonal skills, both written and verbal, necessary to interact with personnel in different functional groups.</p>\n\n<p>Oversee 3rd party vendor application development (local &amp; off-shore).</p>\n\n<p>Work equally effectively refining details optimizing a user's experience and architecting scalable reliable systems.</p>\n\n<p>Develop unit tests, integration tests, and useful code documentation.</p>\n\n<p>Experience leading small team of developers, performing code reviews, \nimplementing best practices.</p>\n\n<p>Experience with mobile ALM practices and technologies.</p>\n\n<p>Experience with MDM, deployment processes and options.</p>\n\n<p>Experience with Android and/or iOS Mobile development.</p>\n\n<p>Possess deep understanding of SDLC and other industry standard development practices.</p>\n\n<p>Experience evaluating new technologies and device platforms.</p>\n\n<p>Experience providing feasibility assessments and accurate estimates for project implementations.</p>\n\n<p>Equal Opportunity and Affirmative Action Employer\nWomen/Minorities/Persons with Disabilities/US Veterans</p>\n\n<p>JOB REQUIREMENTS: </p>\n\n<p>To apply for this position, please copy and paste the following link into your browser address bar: \n<a href=\"https://cbre.contacthr.com/60832433\">https://cbre.contacthr.com/60832433</a></p>","how_to_apply":"<p>To apply for this position, please copy and paste the following link into your browser address bar: \n<a href=\"https://cbre.contacthr.com/60832433\">https://cbre.contacthr.com/60832433</a></p>","company":"CBRE","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/a1c18f6c-221c-11e8-8e07-e1c3a27ca935"},{"id":"10319492-2218-11e8-9a54-4736562032b8","created_at":"Wed Mar 07 15:01:05 UTC 2018","title":"TECHNICAL PRODUCT LEAD","location":"Remote","type":"Full Time","description":"<p><strong>DESCRIPTION:</strong>\nClevertech is looking for a Tech Lead to join our worldwide team. Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps.</p>\n\n<p>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</p>\n\n<p>Our technical product leaders spend much of their time in the code. Develop world class software products for the most exclusive companies in the world. 75% of your time leading the technical strategy in the code; 25% of your time in meetings organizing and unlocking the other devs</p>\n\n<p>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</p>\n\n<p><strong>REQUIREMENTS:</strong></p>\n\n<ul>\n<li><p>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</p></li>\n<li><p>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</p></li>\n<li><p>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</p></li>\n<li><p>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</p></li>\n<li><p>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</p></li>\n</ul><p><strong>BENEFITS:</strong></p>\n\n<p><em>Own Your Time</em>\nWe are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p>\n\n<p><em>Recharge Time</em>\nWe insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p>\n\n<p><em>Care For Yourself</em>\nYou’ll receive a health/wellness stipend that can go towards covering medical insurance, dental insurance, or joining a gym!</p>\n\n<p><em>Focused Work</em>\nYou will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p>\n\n<p><em>Learn at your Edges</em>\nWe believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p>\n\n<p><em>Clevertech Swag</em>\nAnd keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p>\n\n<p>Want to learn more about Clevertech and the team? Check out <a href=\"https://youtu.be/KwOz-y4uuWk\">https://youtu.be/KwOz-y4uuWk</a></p>","how_to_apply":"<p><a href=\"https://hire.clevertech.biz/job/587cf23957e2b97032a5528d?src=Github\">https://hire.clevertech.biz/job/587cf23957e2b97032a5528d?src=Github</a></p>","company":"Clevertech","company_url":"https://clevertech.biz/","company_logo":null,"url":"http://jobs.github.com/positions/10319492-2218-11e8-9a54-4736562032b8"},{"id":"d9983c7c-3999-11e7-8222-72f96992a639","created_at":"Wed Mar 07 08:34:11 UTC 2018","title":"Senior Product Engineer - Ruby + JavaScript ","location":"Amsterdam/Remote","type":"Full Time","description":"<p>Senior Product Engineer (full-time+remote).</p>\n\n<p>Deliver value every day and have an impact on the world!</p>\n\n<p>Our mission is simple: we want to revolutionize digital catalogs. That’s why we’re dedicated to building a beautiful web app with meticulous attention to quality. Working from our office in Amsterdam, we use many technologies (JS (Node, React, Backbone, Redux), Ruby (RoR)) to change the catalog forever. We believe in getting things done, making decisions fast, and not wasting time in endless meetings. We do this by listening to our customers, checking the data, and trusting our gut.</p>\n\n<p>Everyone in our development team works together and contributes to the success of our product, including UX designer and product manager. The engineer that we’re looking for is pragmatic, loves to get things done and has a strong focus on results. We promise to get rid of everything that stands in your way so you can create your best work. If this sounds like your kind of place, it’s time to get in touch.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Performance, stability and scalability of our stack</li>\n<li>Product development</li>\n<li>Contributing to our development, product and design strategy</li>\n</ul><p>Skills:</p>\n\n<ul>\n<li>Proactively solving challenges</li>\n<li>Delivering features end to end</li>\n<li>Designing and implementing back-end and front-end architecture</li>\n<li>Deployment architecture and distributed job processing</li>\n<li>Single page JavaScript apps</li>\n<li>Cross-browser compatibility</li>\n<li>Mobile browser performance</li>\n<li>Writing specs/tests</li>\n<li>Ruby on Rails</li>\n<li>React + Redux</li>\n<li>Node.js</li>\n<li>AWS</li>\n<li>Modern JS (ES2015+)</li>\n<li>CoffeeScript</li>\n<li>Backbone.js</li>\n<li>PostgreSQL</li>\n<li>English</li>\n</ul><p>What can you expect from us?</p>\n\n<ul>\n<li>€39.6k-€55.2k gross salary per year.</li>\n<li>8% yearly holiday bonus paid every May</li>\n<li>25 paid vacation days</li>\n<li>A contract of indefinite duration</li>\n<li>Option to work remotely</li>\n<li>Free organic lunch</li>\n<li>We'll cover your travel expenses</li>\n<li>Unlimited budget for the Kindle Store and Apple App Store</li>\n<li>A remarkable company culture</li>\n<li>4 team retreats per year - check our last one <a href=\"https://youtu.be/LSzyVIhMJF8\">https://youtu.be/LSzyVIhMJF8</a>\n</li>\n<li>A great working environment in the center of Amsterdam</li>\n<li>We will challenge and support you to get the most out of your potential</li>\n<li>Equity plan (to be launched soon)</li>\n<li>30% tax ruling (for candidates outside of the NL)</li>\n<li>Visa sponsorship possibilities for candidates outside of the EU</li>\n</ul>","how_to_apply":"<p><a href=\"http://jobs.publitas.com/o/senior-product-engineer/c/new\">http://jobs.publitas.com/o/senior-product-engineer/c/new</a></p>","company":"Publitas","company_url":"https://www.publitas.com/about-us/","company_logo":"http://github-jobs.s3.amazonaws.com/c904fdf0-3999-11e7-9154-369f282201cb.png","url":"http://jobs.github.com/positions/d9983c7c-3999-11e7-8222-72f96992a639"},{"id":"d9fd3c2a-2198-11e8-9d6b-40fea5c261ae","created_at":"Tue Mar 06 23:48:57 UTC 2018","title":"Solutions Architect","location":"United States","type":"Full Time","description":"<p><a href=\"https://citrusbyte.com\">Citrusbyte</a> is a software consultancy that believes in using simple tools to solve problems. We build custom systems for both startups and enterprises - You can see our <a href=\"https://citrusbyte.com/portfolio\">portfolio</a> for more information about our clients.</p>\n\n<p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p>\n\n<p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p>\n\n<p>Most of our projects are written in <strong>Ruby</strong>, so experience in this language is required, but we are looking for polyglot engineers who have a hunger for learning new languages and tools. At Citrusbyte, learning is part of the job, and you should always be able to answer the question: \"what have I learned this week?\"</p>\n\n<p>We believe that less is more and we vehemently value simplicity. This is reflected in the tools we choose to work with. For this reason we tend to avoid using big frameworks like Ruby on Rails and instead lean towards smaller tools like Sinatra, Roda or Cuba.</p>\n\n<p>We have also done projects in <strong>Elixir</strong>, <strong>Node</strong>, <strong>Go</strong>, <strong>Python</strong>, <strong>Lua</strong>, etc. And strive to learn new tools and languages everyday. We believe in always choosing the right tool for the job and we are very open minded about trying different technologies.</p>\n\n<p>As a <strong>Solutions Architect</strong>, you will have a consultative role, directly supporting our clients and our teams so we can achieve our mission. These are some of the things you'll be responsible for:</p>\n\n<h2>Responsibilities</h2>\n\n<h3>Sales</h3>\n\n<ul>\n<li>Assisting the sales team with uncovering and understanding technical requirements from our clients.</li>\n<li>Producing estimates and risk assessments for prospective projects.</li>\n<li>Preparing and delivering technical presentations to support sales.</li>\n<li>Creating artifacts to support the sales process such as prototypes, diagrams, etc.</li>\n</ul><h3>Project Kick-start and Discovery</h3>\n\n<ul>\n<li>Becoming a domain expert for the problems Citrusbyte needs to solve.</li>\n<li>Researching and documenting the client’s existing infrastructure, systems, technologies, teams and in general all the information the engineering team will need to start the project implementation phase successfully.</li>\n<li>Validating integration points into client’s systems, and validating technical hypotheses, through prototyping, tech spikes, and technical feasibility efforts.</li>\n<li>Collaborating with the rest of the team on defining a mission and strategy for the project as well as starting to delineate what the product will be.</li>\n<li>Day-to-day point of contact for all things technical with client stakeholders and client team.</li>\n<li>Guide the client through complex technology selection and platforming decisions to support a successful implementation phase.</li>\n<li>Continually educating client and client stakeholders about the benefits of Citrusbyte’s approach and process to software and solutions development.</li>\n<li>Develop strong and durable relationships with key client stakeholders and client technical/IT organization.</li>\n<li>Contributing to planning a resourcing strategy for the project, taking into consideration the required skill sets, team size, etc.</li>\n</ul><h3>Project Implementation</h3>\n\n<ul>\n<li>Lead the relationship with the client from the engineering side. Able to receive feedback about our engineering team directly and mediate if necessary when there are any conflicts.</li>\n<li>On-boarding and guiding the team throughout the client’s ecosystem (accounts, VPN, who to talk about a particular topic, etc).</li>\n<li>Contributing to design engineering solutions for our client. Stepping back and thinking about what we’re building with a focus on usability, simplicity and quality.</li>\n<li>Helping define the project technology stack and identifying the risks of the project execution plan.</li>\n<li>Ensuring that projects live up to Citrusbyte engineering quality standards.</li>\n<li>Ensuring that multiple projects across a single account adhere to consistent best practices, processes and technology stacks.</li>\n<li>Augmenting the engineering team to solve challenging and complex problems.</li>\n<li>Mentoring and coaching the team to consult with the client, so everyone becomes a trusted advisor and is empowered to take on a consultative role.</li>\n<li>Maintain strong and durable relationships with key client stakeholders and client technical/IT organization.</li>\n</ul><h3>Project Hand-off</h3>\n\n<ul>\n<li>Gathering requirements from the client and any necessary stakeholders for handing over the project.</li>\n<li>Collaborating with the team to create a successful project hand-off plan.</li>\n</ul><h3>Project Support &amp; Maintenance</h3>\n\n<ul>\n<li>Collaborating on defining a resourcing strategy for any support or maintenance commitments after the implementation phase is complete.</li>\n<li>Ensuring that our team has an effective plan for supporting the project as it grows.</li>\n</ul><h2>Job Requirements</h2>\n\n<ul>\n<li>Over 10 years of experience in software engineering.</li>\n<li>Over 5 years of experience directly consulting with clients.</li>\n<li>Proficient and experienced with at least 3 programming languages.</li>\n<li>Demonstrates continuous learning and being up to date with modern technologies.</li>\n<li>Demonstrates a strong preference for simplicity in all aspects of software development.</li>\n<li>Excellent spoken and written english level.</li>\n<li>Lives within UTC-8 and UTC-3.</li>\n</ul>","how_to_apply":"<p>You can apply directly on our <a href=\"http://careers.citrusbyte.com/apply/Yqr8DfDT1l/Solutions-Architect?source=GitHub\">careers page</a></p>","company":"Citrusbyte","company_url":"https://citrusbyte.com","company_logo":"http://github-jobs.s3.amazonaws.com/c8200492-2198-11e8-8e57-a63f8fe1c5e3.png","url":"http://jobs.github.com/positions/d9fd3c2a-2198-11e8-9d6b-40fea5c261ae"},{"id":"4451031e-2184-11e8-8504-ea68f5712fda","created_at":"Tue Mar 06 21:21:26 UTC 2018","title":"Staff Backend Software Engineer ","location":"Remote Or San Francisco ","type":"Full Time","description":"<p>CircleCI is looking for an experienced back end software engineer to help us in our transition to a microservices-based architecture. In this role, you will work on a cross-functional team of 5-7 engineers to iteratively deliver customer value while building features and services within our new microservice ecosystem. </p>\n\n<p>At CircleCI you will be working with a team who values trust, respect, and diversity. We are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are remote-friendly, and are looking for people who are passionate about helping shape software engineering best practices for the industry as a whole. While we can support a remote role anywhere you also have the option to work out of our Toronto or San Francisco office.</p>\n\n<p>To thrive in this role you are someone who works well in teams and enjoys collaborating. Furthermore, you understand the business impact of your code and enjoy incorporating the business objectives into your approach to development. You enjoy working with Product to find the best solution to the problem at hand, and can balance technical tradeoffs with delivering customer value quickly and iteratively.</p>\n\n<p><b>About CircleCI</b></p>\n\n<ul>Velocity is critical for software teams in today's competitive landscape, but maintaining speed can be difficult as apps and systems grow larger and more complex. CircleCI’s platform allows developers to rapidly release code (for web and mobile apps) they trust by automating the build, test, and deploy process. CircleCI enables developers to detect and fix bugs before they even reach customers. Thousands of leading companies including Facebook, Kickstarter, Shyp and Spotify rely on CircleCI to accelerate delivery of their code and enable developers to focus on creating business value fast.</ul><ul>\n<b>About this role:</b>\n<li>Work closely with Product to ensure delivery of high value customer facing features</li>\n<li>Comfortable designing across architectural styles to fit the needs of the business</li>\n<li>Own microservices throughout their entire lifecycle, from the first lines of code through deployment, production monitoring, and maintenance</li>\n<li>Work on cross-functional, feature-driven engineering teams</li>\n<li>Program in Clojure on a daily basis</li>\n<li>Help shape how we design, release, and maintain microservices</li>\n</ul><p><b>You have:</b></p>\n\n<ul>\n<li>6+ years of back end development experience</li>\n<li>Strong understanding of the business impact of your work</li>\n<li>Experience with microservice architectures</li>\n<li>Experience with functional programing</li>\n<li>A deep appreciation for, and abilities to support, your development with appropriate testing</li>\n</ul><p><b>You Enjoy:</b></p>\n\n<ul>\n<li>Working in a highly collaborative environment</li>\n<li>Supporting an environment that values trust, respect, and diversity</li>\n<li>Exploring different methods for efficiently delivering code and customer value</li>\n<li>Delivering value to customers</li>\n<li>Sharing your expertise and encouraging best practices</li>\n</ul><p>CircleCI is a Bay Area Best Places to Work 2016 award winner. Founded in 2011 and headquartered in beautiful downtown San Francisco with a global remote workforce, CircleCI is venture backed by Scale Venture Partners, DFJ, Baseline Ventures and Harrison Metal Capital. </p>\n\n<p>We care deeply about diversity and inclusivity. We’re hiring at all experience levels, and seek talented teammates from a wide variety of backgrounds and experiences who are equally committed to cultivating a work environment of respect and kindness. We carefully consider every applicant that takes the time to apply.</p>","how_to_apply":"<p><a href=\"https://jobs.lever.co/circleci/2f0ac127-59c0-4bf9-b508-521494eabcbb?lever-origin=applied&amp;lever-source%5B%5D=GITHUB\">https://jobs.lever.co/circleci/2f0ac127-59c0-4bf9-b508-521494eabcbb?lever-origin=applied&amp;lever-source%5B%5D=GITHUB</a></p>","company":"CircleCI","company_url":"http://www.circleci.com ","company_logo":"http://github-jobs.s3.amazonaws.com/18925c64-2184-11e8-94a6-7ec81ae46b3f.jpg","url":"http://jobs.github.com/positions/4451031e-2184-11e8-8504-ea68f5712fda"},{"id":"0a5c9c78-2183-11e8-876a-40ccbde1ead0","created_at":"Tue Mar 06 21:13:04 UTC 2018","title":"Senior Software Architect","location":"Venice, CA","type":"Full Time","description":"<p>About Bites:</p>\n\n<p>Bites is an education technology company focused on personalized learning both within the news and traditional classroom instructional cycle. Through its two product offerings, Bites Media and Bites Labs, the company seeks to penetrate with offerings that complement each other from initial development to market offering.</p>\n\n<p>Bites is searching far and wide for an awesome Lead Software Engineer! Based in Venice, Bites is a seed funded startup that focuses on personalized learning platforms — transforming the way teachers engage and support their students. You will be building out the architecture for our product offerings and helping to build a scalable team.</p>\n\n<p>If that sounds like you, we'd love to talk to you!</p>\n\n<p>Responsibilities:\nDesign and code innovative, scalable and robust features on both the backend and the web application layers.\nParticipate in all aspects of the project lifecycle, from ideation to specification to release.\nCollaborate closely with small, nimble, cross-functional teams, product managers and designers.</p>\n\n<p>Requirements:\nA Bachelor’s degree in Computer Science or related degree.\n4+ years hands on experience in full-stack software development and architecture. Prior management/mentorship experience.\nSignificant experience with at least one of the following programming languages: Python, Ruby, C#, PHP or Javascript.\nStrong experience designing and working with relational databases (/MySQL/MSSQL).\nProficient front-end web development skills -- HTML/CSS/JS.\nStrong experience building high scale and high performance applications.\nDevOps experience building reliable applications through automated testing, continuous integration, monitoring, and analytics.\nA solid grounding in Computer Science fundamentals, data structures, algorithms, and deftness at object-oriented design and systems architecture.</p>\n\n<p>Leadership skills:\nHave an ownership mentality.\nExperienced as technical lead on a project.\nDemonstrated experience mentoring other engineers.\nProvide full-stack expertise to the engineering team.\nPassionate about best practices on code quality and performance.\nAbility to effectively communicate with technical and non-technical teams.\nAbility to measure the risk of choosing a new technology from the point of view of delivering the product on time and training the team.\nStrong work ethics and leads by example.\nIt bothers you if your software is buggy and doesn't perform optimally.</p>\n\n<p>Bonus Points:\nExperience with CSS Preprocessors (Sass or Less)\nExperience with React, Backbone or any other JavaScript frameworks a major plus.\nExperience giving technical mentorship and best practices training to peers.\nDeep understanding of Agile software development lifecycle.\nInterest and/or love of K-12 education.</p>","how_to_apply":"<p>To apply please send resumes and introduction to <a href=\"mailto:nick@bitesmedia.com\">nick@bitesmedia.com</a> and cc <a href=\"mailto:benshahbaz@gmail.com\">benshahbaz@gmail.com</a>.</p>\n\n<p>Thank you.</p>","company":"Bites Media","company_url":"http://bitesmedia.com","company_logo":null,"url":"http://jobs.github.com/positions/0a5c9c78-2183-11e8-876a-40ccbde1ead0"},{"id":"dd29b0b2-214e-11e8-8097-282ce97b1636","created_at":"Tue Mar 06 14:59:30 UTC 2018","title":"Researcher - Machine Learning","location":"Nieuwegein (The Netherlands)","type":"Full Time","description":"<p>The Diagnostics &amp; Prognostics team within the SKF Research &amp; Technology Development group is responsible for generating new knowledge and technology in the field of bearing and machine monitoring. The deliverables of this team are directly supporting SKF’s journey through digital transformation and will change the way we do business. By obtaining and interpreting measurement data from bearings in the field, SKF strives for a paradigm shift from unplanned to scheduled maintenance. This enables SKF to move away from classical transactional business models to performance based service contracts.<br><br>\nTo strengthen our team in <strong>Nieuwegein </strong>we are looking for a:<br><br><strong>Researcher - Machine Learning</strong><br><br><strong>Job description</strong><br>\nIn this role, you will be working in multiple R&amp;D projects. In accordance with project needs, your main responsibilities will be (but are not limited to):</p>\n\n<ul>\n<li>Data wrangling: data transformation, feature extraction, principal component analysis and clustering</li>\n    <li>Using pattern recognition in time series (e.g. vibration, temperature) to detect anomalies</li>\n    <li>Develop technology and algorithms to make a prognosis of the remaining life of a mechanical system in operation</li>\n    <li>Develop machine learning algorithms using supervised and unsupervised learning</li>\n    <li>Collaborate with researchers in other areas such as tribology to combine physical modelling and data driven approaches (hybrid modelling)</li>\n    <li>Use automation tools for optimization of machine learning algorithms and model validation</li>\n</ul><p><br><strong>Job requirements</strong></p>\n\n<ul>\n<li>\n<strong>Masters </strong>or <strong>PhD degree </strong>in <strong>mathematics</strong>, <strong>statistics</strong>, <strong>computer science </strong>or related discipline</li>\n    <li>\n<strong>Proven record </strong>in <strong>researching </strong>and <strong>applying machine learning techniques</strong> (e.g. speech recognition, image recognition and classification)</li>\n    <li>Affinity with mechanical systems and signal processing</li>\n    <li>\n<strong>Skilled in Matlab </strong>is <strong>required</strong>, preferred would be a second programming language, like C++, Python or R</li>\n    <li>Self-driven professional and team player</li>\n    <li>Good command of <strong>English</strong>\n</li>\n</ul><p><br><strong>Our offer</strong><br>\nWe offer you the opportunity to work in an innovative and well-equipped R&amp;D environment, which is part of a large, successful company with an excellent reputation. You will join a team of well-motivated colleagues and will have a lot of international contacts. We look forward to see you develop as a professional who creates a career in SKF and we will support your steps. Of course, our employment conditions are competitive.<br><br><strong>About SKF</strong><br>\nSKF works to reduce friction, make things run faster, longer, cleaner and more safely. Doing this in the most effective, productive and sustainable way has made the SKF Group a leading global supplier of products, solutions and services within rolling bearings, seals, mechatronics, services and lubrication systems. Services include technical support, maintenance services, condition monitoring, asset efficiency optimization, engineering consultancy and training. Check out <a href=\"https://ltpx.nl/2s1z6Bv\" target=\"_blank\"><strong><a href=\"http://www.skf.com\">www.skf.com</a></strong></a> for more information about our organization.<br><br>\nIf you have any questions regarding this job posting, please contact Mr. André van IJzendoorn, tel: +31(0)30 6075835, e-mail: <a href=\"mailto:andre.van.ijzendoorn@skf.com\"><strong><a href=\"mailto:andre.van.ijzendoorn@skf.com\">andre.van.ijzendoorn@skf.com</a></strong></a><br><br><em>Acquisition is not appreciated</em>.<img alt=\"\" src=\"https://bcontrol.brockmeyer.nl/track.php?orderid=42013\"></p>","how_to_apply":"<p><strong>Interested?</strong><br>\nIf you are interested and meet the requirements, please apply with your CV and motivation letter by using the <a href=\"https://ltpx.nl/4YyJVnf\" target=\"_blank\"><strong>online application form</strong></a>.<br><br></p>","company":"SKF B.V.","company_url":"http://www.skf.com/benelux/nl/our-company/index.html","company_logo":"http://github-jobs.s3.amazonaws.com/c2505822-214e-11e8-8522-6dcf8a2d19b2.JPG","url":"http://jobs.github.com/positions/dd29b0b2-214e-11e8-8097-282ce97b1636"},{"id":"1e33856e-2146-11e8-99cf-37613fc7e859","created_at":"Tue Mar 06 13:56:32 UTC 2018","title":"Director, Software R&D","location":"Santa Ana, California","type":"Full Time","description":"<p>Director, Software R&amp;D(Job Number: 3808180220)</p>\n\n<p>Description:\nJohnson &amp; Johnson Vision Surgical, part of the Johnson &amp; Johnson Family of Companies, is currently recruiting for a Director, Software - R&amp;D to be located in Milpitas, Ca or Santa Ana, Ca\n.\nJohnson &amp; Johnson Vision Surgical (\"JJVS\") is focused on the discovery, development and commercialization of medical devices for cataract and refractive surgery. As a global cataract leader, JJVS provides intraocular lenses (both monofocal reimbursed and premium IOLs) that are specially designed to provide optimized visual outcomes, phacoemulsification and femtosecond laser equipment to safely and efficiently remove cataracts and a full offering of surgical adjuncts, including sterile viscosurgical devices/solutions.</p>\n\n<p>JJVS is the global market leader in the presbyopia correcting IOL marketplace and holds strong #2 positions in all other cataract surgery markets in which it competes. JJVS is also the global market leader in laser refractive surgery and provides excimer and femtosecond lasers and advanced diagnostic devices for corneal refractive surgery. JJVS provides its products in more than 150 countries (more than 60 with a direct sales presence) worldwide.</p>\n\n<p>The Director, Software - R&amp;D, will be responsible for leadership and management of software R&amp;D personnel.</p>\n\n<p>The Director, Software - R&amp;D will:</p>\n\n<ul>\n<li><p>Direct the planning and execution of software development and technical support for J&amp;J Vision's equipment product lines, which currently includes femtosecond lasers, excimer lasers, integrated aberrometer/topographer diagnostic systems, phacoemulsification devices, dry eye diagnostic and treatment systems, apps and websites.</p></li>\n<li><p>Assure compliance of all software and software- related activities with J&amp;J, government, quality and regulatory standards, policies and procedures.</p></li>\n<li><p>Address compliance with applicable Enterprise and Business Unit policies and procedures.</p></li>\n<li><p>Lead and manage the development and technology transfer of software solutions for J&amp;J Vision's current Product Portfolio includes excimer lasers, femtosecond lasers, aberrometer/topographer diagnostic systems, phacoemulsification systems, dry eye diagnostic and treatment systems and associated products.</p></li>\n<li><p>Lead the development and integration of software products that meet the needs of the company's customers.</p></li>\n<li><p>Provide the company with significant competitive differentiation against competitive companies and support the revenue growth requirements of the business.</p></li>\n<li><p>Provide leadership and vision for a multi-site R&amp;D software teams via the development and implementation of comprehensive software design for the lifecycle of the various product lines.</p></li>\n<li><p>Lead resource allocation, budgeting, outsourcing allocation, and personnel development as it relates to software development.</p></li>\n<li><p>Both directly and through subordinates, account for product development, product quality, documentation, support and packaging of software components.</p></li>\n<li><p>Work closely with the various cross-functional leaders to coordinate development of software and hardware to ensure timely registration and commercialization of J&amp;J Vision's equipment products.</p></li>\n<li><p>Supervise and lead Manager and Senior Manager level software professionals.</p></li>\n<li><p>Direct responsibility for software engineers, consultants and technicians.</p></li>\n<li><p>Direct the development and execution of software strategies and tactical plans to ensure the development, registration and commercialization of J&amp;J Vision's equipment products, while following internal policies and procedures and applicable US and Foreign regulatory standards and requirements.</p></li>\n<li><p>Prepare, manage and direct the execution of the Software R&amp;D operating budget.</p></li>\n<li><p>Hire, train and ensure retention of high-caliber individuals within the Software R&amp;D organization.</p></li>\n<li><p>Identify, retain and direct external software consultants and consultancy firms.</p></li>\n</ul><p>Qualifications:</p>\n\n<ul>\n<li><p>BS in Software Engineering, Computer Science or equivalent is required, advanced degree (MS or PhD) preferred.</p></li>\n<li><p>10 years of experience in the conduct and management of software and product development with at least 5 years of experience in developing software for medical devices is required.</p></li>\n<li><p>Excellent technical judgement and strong leadership skills as evidenced by a succession of technical software management positions with increasing responsibility is required.</p></li>\n<li><p>Experience in software development and new product commercialization in the medical device industry as demonstrated by a track record of successful development and commercialization of new products is required.</p></li>\n<li><p>Experience with cybersecurity and IoT (Internet of Things) is required.</p></li>\n<li><p>Familiarity with ophthalmic surgery is preferred.</p></li>\n<li><p>Complete understanding of software design, development, requirements management, and verification and validation processes, including the use of state of the art tools for management thereof is required.</p></li>\n<li><p>Excellent communication skills including both written and verbal in required</p></li>\n<li><p>Up to 10-15% domestic travel is required.</p></li>\n</ul><p>Primary Location:\nNorth America-United States-California-Santa Ana</p>\n\n<p>Other Location: North America-United States-California-Milpitas</p>\n\n<p>Organization:\nAMO US Holdings, Inc.. (6234)</p>\n\n<p>Job Function:\nR&amp;D</p>\n\n<p>Travel\n0-10%</p>\n\n<p>Apply Here: <a href=\"http://www.Click2Apply.net/4gm2kz3p8skqx985\">http://www.Click2Apply.net/4gm2kz3p8skqx985</a></p>\n\n<p>PI101457355</p>","how_to_apply":"<p>Apply Here: <a href=\"http://www.Click2Apply.net/4gm2kz3p8skqx985\">http://www.Click2Apply.net/4gm2kz3p8skqx985</a></p>","company":"Johnson & Johnson","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/1e33856e-2146-11e8-99cf-37613fc7e859"},{"id":"58e8dfac-213b-11e8-843b-53b53b103189","created_at":"Tue Mar 06 12:39:48 UTC 2018","title":"Senior Javascript Developer - Remote","location":"Remote","type":"Full Time","description":"<p>The team at Kodify is looking for a talented Javascript Developer to join our remote team. This specific role is open to remote candidates based in European Union only (a must for us). With you on board, we’re looking to expand our team (currently 10 developers working across multiple European locations) and take our projects to a whole new level. Ability to work with our stakeholders to implement the features required.</p>\n\n<p>This role is specifically looking for people with skills within the field of BILLING and PAYMENTS, and as such, experience with 3rd party suppliers, databases, security (both network and data) are a significant requirement. The role will be to build and maintain a billing microservice, that allows our customers to confidently pay for our services, and allows us to manage our customer billing with ease.</p>\n\n<p><strong>KEY RESPONSIBILITIES</strong></p>\n\n<ul>\n<li>Be up to date with current billing solutions and practices</li>\n<li>Create Server side JS required functionality for billing systems</li>\n<li>Responsible for the security of the billing system</li>\n<li>Ensure all code is modular, and where possible developed as reusable</li>\n<li>End-to-end responsibility from technical design to deployment and testing</li>\n<li>Work with stakeholders to ensure they understand possibilities / limitations</li>\n<li>Always work towards making the system as fast as possible</li>\n<li>Become a valued team member, providing feedback to the team</li>\n<li>Take ownership of your code / tasks / role</li>\n<li>Be proud of what you achieve, and of the product, and be one of the driving forces behind always making it better</li>\n<li>When you screw-up - own-up! (We don’t do blame-storming here!)</li>\n<li>Have fun and enjoy your job!</li>\n</ul><p><strong>ABOUT YOU</strong></p>\n\n<ul>\n<li>You’ll be detail focused, and always want to ensure data is handled securely.</li>\n<li>An analytical mind is a must, especially when it comes to dissecting data.</li>\n<li>You’re a real team player. You love to help and find solutions together.</li>\n<li>Your sense of humour will bring a new dynamic to the team - you love to have fun while you work!</li>\n<li>You can think on your feet and adapt well to fast changing environments and priorities.</li>\n<li>You are passionate about software development</li>\n<li>You're able to think beyond code to architecture and user experience</li>\n<li>You have a real ‘Can Do’ work ethic - We are results based, not clock based</li>\n</ul><p><strong>REQUIREMENTS</strong></p>\n\n<ul>\n<li>Expert in understanding and developing billing solutions</li>\n<li>Great Javascript skills</li>\n<li>NodeJS</li>\n<li>MongoDB</li>\n<li>Github</li>\n<li>Security</li>\n</ul><p><strong>Bonus points:</strong>\nRecent experience with Rocketgate or other billing gateway\nRedis\nMessage Queuing systems\nReact\nHTML / CSS\nTDD\nYour own open source projects\nHigh traffic websites\nLinux\nAWS Technologies (e.g. EC2, S3, Cloudformation, ..)\nUnderstanding of, and agreement with, Agile principles\nKnowledge and experience in Git and JIRA</p>\n\n<p><strong>Other:</strong>\nExperience working remotely and with remote teams\nExperience managing high traffic and content heavy websites.</p>\n\n<p><strong>EDUCATION</strong></p>\n\n<p>Education is compulsory, but where you got it is irrelevant for us! We are looking for someone who has worked in a similar role (or roles) for at least 3 years, and can show us examples of their work. We are not looking for a newbie, nor are we looking for a rockstar, we are looking for a mid to senior level developer who wants to both learn and contribute to our team.</p>\n\n<p>Do you like what you read and want to be part of it? Please send us your CV along with a covering letter explaining why this job is right for you, and why you are right for the job!</p>","how_to_apply":"<p><a href=\"https://kodify.recruitee.com/o/senior-javascript-developer-remote\">https://kodify.recruitee.com/o/senior-javascript-developer-remote</a></p>","company":"Kodify","company_url":"https://kodify.io/","company_logo":"http://github-jobs.s3.amazonaws.com/f953ccaa-213a-11e8-982a-7b310eab5738.jpg","url":"http://jobs.github.com/positions/58e8dfac-213b-11e8-843b-53b53b103189"},{"id":"ea3346f0-2127-11e8-919b-7de09ced390f","created_at":"Tue Mar 06 10:20:41 UTC 2018","title":"Junior Web-Entwickler (m/w) in Vollzeit","location":"Köln (Cologne)","type":"Full Time","description":"<p>wilde van rhee steht für Branding und E-Commerce aus Leidenschaft. Seit über 10 Jahren setzen wir die Wünsche und Ziele unserer Kunden in die Realität um. Seit unserer Gründung durften wir für über 150 Unternehmen arbeiten, viele davon sind seit Jahren treue Kunden.</p>\n\n<p><strong>Deine Aufgaben</strong></p>\n\n<p>Als Teil von wilde van rhee entwickelst du innovative Webseiten mit WordPress und realisierst konversionsstarke E-Commerce-Lösungen mit Shopware und Magento. Außerdem betreust und optimierst du herausfordernde Bestandskunden-Projekte.</p>\n\n<p><strong>Was wir erwarten</strong></p>\n\n<ul>\n<li>Programmieren ist Deine Leidenschaft</li>\n<li>Ausbildung, Studium oder Quereinstieg, alles ist möglich</li>\n<li>Erfahrung mit PHP, HTML5, Ajax, JavaScript, jQuery, CSS3, und MySQL</li>\n<li>Idealerweise erste Erfahrung mit Shopsystemen und CMS-Lösungen</li>\n<li>Du bringst eine große Portion technische Neugier und ein gutes Verständnis für komplexe Zusammenhänge mit</li>\n</ul><p><strong>Was dich erwartet</strong></p>\n\n<ul>\n<li>Eine eingespielte und schlagkräftige Truppe, plus vierbeiniges Unterhaltungsprogramm</li>\n<li>Gut angebundener und moderner Arbeitsplatz</li>\n<li>Schulungen, Fachmesse oder Konferenzen, der Schreibtisch muss auch mal verlassen werden</li>\n<li>Work hard, play hard – Für die Pausen zwischendurch stehen Xbox und Kicker bereit</li>\n</ul><p><strong>So bewirbst du dich</strong></p>\n\n<p>Bitte schick uns deine Bewerbung in digitaler Form, unter Angabe deiner Gehaltsvorstellung und deinem möglichen Eintrittstermin an Alexander Boros: <a href=\"mailto:bewerbung@wildevanrhee.de\">bewerbung@wildevanrhee.de</a></p>","how_to_apply":"<p>Bitte schick uns deine Bewerbung in digitaler Form, unter Angabe deiner Gehaltsvorstellung und deinem möglichen Eintrittstermin an Alexander Boros: <a href=\"mailto:bewerbung@wildevanrhee.de\">bewerbung@wildevanrhee.de</a></p>","company":"wilde van rhee GmbH","company_url":"https://wildevanrhee.de","company_logo":"http://github-jobs.s3.amazonaws.com/8291580c-2127-11e8-9e07-04dbb229a65e.jpg","url":"http://jobs.github.com/positions/ea3346f0-2127-11e8-919b-7de09ced390f"},{"id":"bdaa3cd6-20b6-11e8-9505-488a585a8398","created_at":"Mon Mar 05 20:50:43 UTC 2018","title":"DevOps Engineer [AWS, Chef, Ruby]","location":"Your house","type":"Full Time","description":"<p>Aha! is looking for a DevOps engineer to build and maintain our highly automated AWS-based infrastructure. We value simplicity, robustness, performance, and low operational overhead. We like to script and configure using Ruby &amp; Chef (via AWS OpsWorks).</p>\n\n<p>We are seeing rapid growth, which means there are many interesting scale, performance, and architectural projects to tackle. DevOps engineers work as part of our overall engineering team, following the same development workflow we use for all parts of the product.</p>\n\n<p>As a DevOps Engineer at Aha!, you will have an excellent opportunity to join a breakthrough and profitable company that is growing fast. Aha! was founded by a proven team of Silicon Valley veterans whose last two businesses were acquired by well-known public companies. More than 150,000 users trust Aha! to link their brilliant strategy to their team's work and create visual roadmaps.</p>\n\n<h4>We are looking for someone who:</h4>\n\n<ul>\n<li>  Has built and operated large-scale web applications</li>\n<li>  Is an expert in Ruby scripting --- Ruby on Rails experience is a big plus</li>\n<li>  Has a \"security-first\" mentality</li>\n<li>  Has a computer science degree or demonstrated experience solving challenging CS problems</li>\n</ul><h4>We are committed to being great, and we want someone who:</h4>\n\n<ul>\n<li>  Can work at a fast-paced company where the feedback cycle is measured in hours rather than weeks</li>\n<li>  Has a \"get it done\" attitude and a background of delivering superb work again and again</li>\n<li>  Is seeking a career-defining opportunity and a proven, results-oriented team that has sold multiple software companies</li>\n</ul><p><em>We are building a distributed team, and you can work from anywhere in North America for this role. We offer generous salary, equity, benefits, and a profit-sharing program.</em></p>\n\n<p><strong>For immediate consideration, please follow these <a href=\"https://blog.aha.io/the-best-cover-letters-that-ceos-love-to-read/\" title=\"Read this first\">helpful guidelines</a> and contact us at <a href=\"mailto:Engineering-jobs@aha.io\">Engineering-jobs@aha.io</a>. Be sure to include a link to your GitHub or code portfolio. If you have the right background, we will quickly follow up with you. We are not working with recruiters or third-party agencies.</strong></p>","how_to_apply":"<p>For immediate consideration, please follow these <a href=\"https://blog.aha.io/the-best-cover-letters-that-ceos-love-to-read/\" title=\"Read this first\">helpful guidelines</a> and contact us at <a href=\"mailto:Engineering-jobs@aha.io\">Engineering-jobs@aha.io</a>. Be sure to include a link to your GitHub or code portfolio. If you have the right background, we will quickly follow up with you. We are not working with recruiters or third-party agencies.</p>","company":"Aha!","company_url":"https://www.aha.io/","company_logo":"http://github-jobs.s3.amazonaws.com/b47150a0-20b6-11e8-830e-f9a1ab6b06ad.png","url":"http://jobs.github.com/positions/bdaa3cd6-20b6-11e8-9505-488a585a8398"},{"id":"32409416-208d-11e8-9bb8-76708c4b53e0","created_at":"Mon Mar 05 15:54:26 UTC 2018","title":"Full Stack Software Engineer (Elixir, Vue.js)","location":"New York","type":"Full Time","description":"<p><strong>The Role</strong>\nThis is an opportunity to join a small, growing team and make a substantial impact at Bowery. We’re looking for someone that can learn, adapt and roll with a fast-paced, ever-changing environment and who isn’t afraid of uncertainty. </p>\n\n<p>Software Engineering at Bowery involves developing software systems that power a modern farm. This includes building out work management, data collection, visualization, and farm automation systems. You’ll be part of idea generation, design, prototyping, planning, and the execution of new software components of all aspects of our farms.</p>\n\n<p>The software stack at Bowery consists of a few, focused Elixir services running in AWS, Phoenix + Vue.js on the front-end, and Elixir (Nerves) running on thousands of in-house built devices on-premise in our farms. We're utilizing an event-driven architecture, RPC, and Channels/WebSockets to pass data throughout our services and real-time UI's.</p>\n\n<p><strong>What you’ll do at Bowery</strong></p>\n\n<ul>\n<li>Create innovative automation solutions and advance the state of indoor farming alongside mechanical engineers, agricultural scientists, and the farm operations team.</li>\n<li>Build responsive, mobile-first web applications to support the demands of farm operations and agricultural science teams.</li>\n<li>Develop systems to collect, process, and visualize data related to plant health and growing environment characteristics.</li>\n<li>Optimize crop cycles and workflow schedules to improve yields and make the best use of time in the farm.</li>\n<li>Scale systems to handle more farms, more sensors, more crops, and more operators.</li>\n</ul><p><strong>Who you are</strong></p>\n\n<ul>\n<li>You’ve got a BS in Computer Science or are just passionate about crafting better software.</li>\n<li>You proactively mitigate issues through test-driven development, continuous deployment, and thoughtful application of monitoring and alerting.</li>\n<li>You’ve developed and scaled production web applications using Elixir/Phoenix, Rails, Django, or similar backend MVC frameworks.</li>\n<li>You’ve built user interfaces using JavaScript frameworks like Vue.js, React, or Angular.</li>\n<li>You’ve used implementations of protocols like MQTT, XMPP, and AMQP to handle messaging between services in a distributed system.</li>\n<li>You’re excited about how advancements in machine learning and IoT can work in harmony to improve the state of the planet.</li>\n<li>You believe that teams succeed and fail together and take responsibility for ensuring the success and safety of your teammates.</li>\n<li>You’re confident taking ownership of projects from start to finish and enjoy the process of turning nebulous ideas into reality.</li>\n</ul><p><strong>About Bowery</strong>\nBowery is growing food for a better future by revolutionizing agriculture. Our modern farming company combines the benefits of the best local farms with advances made possible by technology to grow post-organic produce you can feel good about eating. BoweryOS, our proprietary software system, uses vision systems, automation technology, and machine learning to monitor plants and all the variables that drive their growth 24/7. Because we control the entire process from seed to store, Bowery farms use zero pesticides, 95% less water, and are 100+ times more productive on the same footprint of land than traditional agriculture. Bowery produce is currently available at select Whole Foods and Foragers stores in the Tristate area, and featured on the menus of Tom Colicchio’s New York restaurants Craft and Temple Court. Based in New York City, the company has raised $27.5M from leading investors including General Catalyst, GGV Capital, GV (formerly Google Ventures) and First Round Capital.</p>\n\n<p><strong>We are an equal opportunity employer. We welcome people of different backgrounds, experiences, abilities and perspectives. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.</strong></p>","how_to_apply":"<p><a href=\"https://hire.withgoogle.com/public/jobs/boweryfarmingcom/view/P_AAAAAADAAADIT_40mPTc_E\">https://hire.withgoogle.com/public/jobs/boweryfarmingcom/view/P_AAAAAADAAADIT_40mPTc_E</a></p>","company":"Bowery Farming","company_url":"https://boweryfarming.com/","company_logo":"http://github-jobs.s3.amazonaws.com/29bbbfdc-208d-11e8-816b-a758e9890938.jpg","url":"http://jobs.github.com/positions/32409416-208d-11e8-9bb8-76708c4b53e0"},{"id":"b446b992-206d-11e8-9656-af701665eff6","created_at":"Mon Mar 05 12:16:33 UTC 2018","title":"Senior Android Developer ","location":"Mannheim","type":"Full Time","description":"<p>Stocard has been listed as one of the best apps of the year by Apple and is one of the few Android Excellence apps selected by the Google team. We are looking for smart, talented and creative people who share our vision, live and breathe mobile technology. Be an active part of our journey! </p>\n\n<p>Join us as a…</p>\n\n<p>SENIOR ANDROID DEVELOPER (full-time, m/f)</p>\n\n<p>As our Android developer, you will architect, build and maintain our native Android app. Challenge yourself to find creative ways to implement new features that fit in smoothly – using the best available technologies like Kotlin, RxJava or Couroutines. You’ll be working in a cross-functional team contributing to the overall experience and architecture. Take initiative to suggest new features and ideas and push forward our development process. Share your knowledge and keep up the high level of quality in our team through reviews, pairing and mentoring. Focus on a great user experience and use instant feedback from our users to make the app perfect.</p>\n\n<p>Some great projects our Android Engineers have been working on lately…</p>\n\n<ul>\n<li>Building features tightly integrated with location based services</li>\n<li>Making the app context aware with the help of the Google Awareness API</li>\n<li>Development and implementation of a sync framework which enables our users to perform most actions even while offline</li>\n<li>Our mobile payment solution which is built on top of multiple third-party services</li>\n</ul><p>Skills and experiences exciting us…</p>\n\n<ul>\n<li>A passion for innovation and mobile technologies, interest in mobile wallets</li>\n<li>In-depth knowledge of the Android SDK and rock-solid coding skills (experience in Kotlin is a plus)</li>\n<li>Love for solving technical challenges with other talented coders</li>\n<li>Experience with iOS, backend and other relevant technologies is a plus</li>\n<li>Degree in Computer Science, Computer or Systems Engineering or equivalent experience,</li>\n<li>Personal projects or contribution to open source projects in the Android ecosystem</li>\n<li>Interest / experience in payment, loyalty or shopping</li>\n</ul><p>This and more is awaiting you…</p>\n\n<ul>\n<li>An energetic and motivated team in a product-focused culture</li>\n<li>A highly attractive package of fun, salary and flexible working hours</li>\n<li>An inspiring working atmosphere in a beautiful open office space with a spectacular view of the waterfront</li>\n<li>Excellent equipment of your choice and access to the best tools available</li>\n<li>Skill sharing, tech talks and internal hackathons</li>\n<li>Regular team lunches, fresh office snacks &amp; drinks</li>\n<li>Enjoy a healthy lifestyle with our subsidized gym membership</li>\n</ul><p>Are you up for the challenge?</p>","how_to_apply":"<p>To apply for this position, please upload your info and files below. Alternatively you can also send us an e-mail with all info and files via iwanttowork@stocard.de.\u2028 </p>\n\n<p>Contact person: Gabriella Schwarcz</p>","company":"Stocard GmbH","company_url":"https://stocardapp.com","company_logo":"http://github-jobs.s3.amazonaws.com/76e0dec0-206d-11e8-9a0d-224e81c121f9.png","url":"http://jobs.github.com/positions/b446b992-206d-11e8-9656-af701665eff6"},{"id":"7526b9f6-206d-11e8-8291-df97146bf6ed","created_at":"Mon Mar 05 12:06:30 UTC 2018","title":"Technisch Software Engineer","location":"Nederland","type":"Full Time","description":"<p><strong>Technisch Software Engineer<br><br>\nDe functie</strong><br>\nLigt jouw passie bij techniek en vind je het leuk om complexe technische uitdagingen aan te gaan? Dan past de functie van Technisch Software Engineer goed bij jou. In deze functie kun je op basis van Technology Consulting and Engineering brede ervaring opdoen binnen verschillende werkgebieden en omgevingen. Voor jou de ideale mogelijkheid om jouw (technische) kennis in te zetten en uit te breiden.<br><br><strong>Jouw profiel</strong></p>\n\n<ul>\n<li>Een <strong>afgeronde</strong> <strong>opleiding</strong> op <strong>universitair</strong> of <strong>hbo-niveau</strong> op gebied van <strong>Technische</strong> <strong>Informatica</strong> of <strong>Elektrotechniek</strong>.</li>\n    <li>Professionele <strong>softwareontwikkelervaring</strong> met C/ C++/ C# of Java.</li>\n    <li>Je beschikt over goede kennis van en <strong>ervaring</strong> met <strong>OO</strong> en <strong>UML</strong>.</li>\n    <li>Je hebt gewerkt met Windows en/of Unix/ Linux ontwikkelomgevingen.</li>\n    <li>Pre: ervaring binnen Multithreaded/ Realtime omgevingen.</li>\n    <li>Goede sociale en communicatieve vaardigheden.</li>\n    <li>Goede beheersing van de Nederlandse en <strong>Engelse</strong> <strong>taal</strong>, zowel mondeling als schriftelijk.</li>\n</ul><p><br><strong>Persoonlijkheid</strong><br>\nJe beschikt over goede communicatieve en sociale vaardigheden en vindt het interessant om technische uitdagingen aan te gaan. Binnen uiteenlopende projecten maakt jouw vakmanschap het verschil. Daarnaast ben je proactief ingesteld en werk je graag in teamverband.<br><br><strong>ALTEN biedt</strong></p>\n\n<ul>\n<li>Technisch uitdagende projecten met volop doorgroeimogelijkheden.</li>\n    <li>Direct een vast dienstverband.</li>\n    <li>Uitstekend salaris en prima arbeidsvoorwaarden, zoals een lease-auto, premievrije pensioenvoorziening en uiteraard en een breed scala aan opleidingsmogelijkheden.</li>\n    <li>Volop aandacht en ruimte voor ontplooiing op zowel technisch als persoonlijk vlak.</li>\n    <li>Een ambitieuze omgeving met technische collega’s.</li>\n    <li>Een internationale sfeer met veel contacten door heel Europa.</li>\n</ul><p><br><strong>ALTEN</strong><br>\nALTEN voert via haar kantoren, projecten uit voor vooraanstaande technisch georiënteerde bedrijven door heel Nederland. Dit kan op locatie bij de opdrachtgever zijn, maar kan ook plaatsvinden op het ALTEN Delivery Center in Eindhoven, Capelle aan den IJssel of Apeldoorn. Je werkzaamheden zijn met name gericht op R&amp;D, waarbij je betrokken wordt bij het opstellen en uitwerken van het design, de implementatie van de software op een kwalitatief hoogstaand niveau. Qua ontwikkel-methodiek wordt bij voorkeur gebruik gemaakt van Agile/ Scrum. Binnen de R&amp;D-omgevingen van de verschillende hightechindustrieën wordt er steeds meer gebruik gemaakt van hoogstaande softwareoplossingen. Het kwalificeren, ontwerpen en ontwikkelen van deze softwareoplossingen vraagt om een helder en abstract denkniveau en de capaciteiten dit te vertalen naar een praktische oplossing. De daadwerkelijke oplossingen kunnen in verschillende ontwikkelomgevingen gerealiseerd worden. Denk hierbij aan R&amp;D voor de meest uiteenlopende toepassingen binnen bijvoorbeeld de medische, industriële of informatiesector.<br><br>\nALTEN heeft ambitieuze groeidoelstellingen voor de komende jaren welke passen binnen de internationale strategie van de ALTEN Groep. Deze groei levert veel kansen op voor getalenteerde ingenieurs die nu kiezen voor een carrière bij ALTEN. Werken bij ALTEN biedt volop uitdaging, solliciteer daarom nu via het <a href=\"https://ltpx.nl/0wfcbNG\" target=\"_blank\"><strong>online sollicitatieformulier</strong></a> om ons team te versterken!<br><br><strong>Informatie</strong><br>\nNeem voor meer informatie vrijblijvend contact op met een van onze Corporate Recruiters: regio Zuid (locatie Eindhoven) via +31(0)40-256 3080, regio West (locatie Capelle aan den IJssel) via +31(0)10-463 7700, regio Oost (locatie Apeldoorn) via +31(0)55-548 6200. Je kunt ook een e-mail sturen naar:<strong> </strong><strong><a href=\"mailto:%20sollicitatie@alten.nl\"></a><a href=\"mailto:sollicitatie@alten.nl\">sollicitatie@alten.nl</a></strong>.<br><br>\nKijk op <a href=\"https://ltpx.nl/KFyW7kG\" target=\"_blank\"><strong><a href=\"http://www.alten.nl\">www.alten.nl</a></strong></a> voor meer informatie over onze organisatie.<br><br><em>Wij werven onze nieuwe collega graag zelf, acquisitie n.a.v. deze vacature is niet gewenst.</em><img alt=\"\" src=\"https://bcontrol.brockmeyer.nl/track.php?orderid=34517\"></p>","how_to_apply":"<p><a href=\"https://ltpx.nl/UW8nyQw\" target=\"_self\">Klik hier om te solliciteren</a></p>","company":"ALTEN Nederland","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/6aa22128-206d-11e8-93e0-8757711de704.jpg","url":"http://jobs.github.com/positions/7526b9f6-206d-11e8-8291-df97146bf6ed"},{"id":"3b4d0238-0841-11e8-83dd-58f9352b3db9","created_at":"Mon Mar 05 09:17:36 UTC 2018","title":"Experienced Mobile Engineer","location":"Remote within EU","type":"Full Time","description":"<p>Loco2's mission is to make booking trains anywhere in Europe as easy and affordable as possible, from epic international adventures to everyday local commutes. Our booking coverage is unrivalled and growing.</p>\n\n<p>We're looking for an experienced mobile engineer to join our growing engineering team. You will help us deliver a world-class mobile experience through our hybrid iOS app, combining fully native views with our Single Page Application (see below).</p>\n\n<p>At Loco2 we care deeply about building an inclusive, open and supportive work environment. We behave with respect for people and the planet and are seeking a diverse range of candidates that share these values.</p>\n\n<p><strong>About us</strong></p>\n\n<p>We're a <a href=\"https://loco2.com/team\">small, passionate and cosmopolitan team</a>, with a healthy remote-first culture and an office in London. Our success is built on trust, empathy and shared knowledge, with our users at the centre of what we do. <a href=\"https://uk.trustpilot.com/review/loco2.com\">We're proud to have an average rating of 9.3 out of 10 on Trustpilot</a> after 22,000 reviews.</p>\n\n<p>We’ve been selling tickets since 2012 (read our <a href=\"https://loco2.com/our-story\">full story here</a>), and we’re growing rapidly as the business matures. Our goal is to scale effectively whilst continuing to delight our users.</p>\n\n<p><strong>Tech stack and role description</strong></p>\n\n<p>Our current mobile applications are <a href=\"https://m.signalvnoise.com/hybrid-development-is-how-we-give-our-teams-of-three-superpowers-2021a84437d\">hybrid</a>, mixing fully native views with numerous embedded web-views, presenting parts of our mobile website.</p>\n\n<p>We’re sticking with the hybrid approach (i.e. we don’t intend to ever have fully native apps) but are now transitioning our traditional multi-page web application to a React-powered single-page application. We’re <a href=\"https://loco2.com/en/careers/web-developer\">hiring separately for experienced front-end developers</a> to accelerate this transition.</p>\n\n<p>Once we’ve transitioned to the SPA, lots of functionality/UX will be identical across our mobile website and applications, but there remain areas where we’ll need to use native functionality. One of Loco2’s main goals is to be useful to customers when they are travelling, and building an exceptional mobile UX that feels truly native is one of our biggest goals for 2018.</p>\n\n<p>Whilst we don’t expect you to be a master of all of the following technologies, our current software stack consists of:</p>\n\n<ul>\n<li>A hybrid iOS app written in Swift</li>\n<li>A hybrid Android app written in Kotlin</li>\n<li>A traditional multi-page web application written in Ruby on Rails, using CoffeeScript and SCSS</li>\n<li>A Ruby library for communicating with train booking APIs</li>\n<li>AWS hosted Docker infrastructure, with continuous delivery</li>\n</ul><p><strong>About you</strong></p>\n\n<p>An ideal candidate:</p>\n\n<ul>\n<li>Has 3+ years of professional mobile application development experience</li>\n<li>Solid experience with native iOS development</li>\n<li>Takes pride in their craft and adheres to industry best practices such as testing, code linting, peer review and clean modular maintainable code</li>\n<li>Has a keen appetite for self-improvement and growth, but doesn't hesitate to ask for help when needed</li>\n<li>Strives to discover and understand the root cause of problems, suggesting new and improved solutions, rather than treating the symptoms</li>\n<li>Is fluent in English and confident communicating and sharing complex information and learnings with both technical and non-technical team members</li>\n<li>Can work hours that have some overlap with London daytime</li>\n<li>Is motivated by Loco2's mission</li>\n</ul>","how_to_apply":"<p>Email <a href=\"mailto:jobs@loco2.com\">jobs@loco2.com</a> and tell us about your skills and experience, plus include links to any relevant public repositories. You can send a CV if you want, but we particularly like reading a well-written email instead/as well.</p>\n\n<p><strong>Unfortunately we can currently only accept applications from within the EU (including the UK).</strong></p>\n\n<p>There are some specific questions we'd like you to answer (feel free to be brief if you’d prefer to elaborate in other areas):</p>\n\n<ol>\n<li>What are some of the most challenging/interesting programming tasks you have worked on?</li>\n<li>Why do you want to work for Loco2?</li>\n<li>What country and timezone do you live in?</li>\n<li>What are your approximate salary expectations? (please state currency)</li>\n</ol><p>We welcome applications from everybody, regardless of race, gender, or sexual orientation.</p>\n\n<p>To try to make the hiring process as fair as possible, if we are interested in your application, then you'll be asked to complete a programming challenge which is judged anonymously. We deliberately anonymise responses to this task in order to mitigate any inherent biases in this regard.</p>\n\n<p>Our emphasis is on finding somebody with demonstrable skills rather than somebody who is good at self-marketing. This process helps us focus on that.</p>\n\n<p><em>Please note that we do not respond to approaches from recruitment agencies, and emails will be marked as spam.</em></p>","company":"Loco2","company_url":"https://loco2.com/en/careers/experienced-mobile-engineer","company_logo":"http://github-jobs.s3.amazonaws.com/c12afc76-0840-11e8-8e83-41340ac9f1a1.png","url":"http://jobs.github.com/positions/3b4d0238-0841-11e8-83dd-58f9352b3db9"},{"id":"a70f5eb8-083b-11e8-80e2-6aeb265cb22e","created_at":"Mon Mar 05 09:17:06 UTC 2018","title":"Experienced Software Engineers","location":"Remote within EU","type":"Full Time","description":"<p>Loco2's mission is to make booking trains anywhere in Europe as easy and affordable as possible, from epic international adventures to everyday local commutes. Our booking coverage is unrivalled and growing.</p>\n\n<p>We're looking for 2 experienced Ruby engineers to join our existing team of six, where you'll help us maintain and improve our existing infrastructure, integrate new rail operator booking systems and scale effectively for our rapidly expanding user base.</p>\n\n<p>At Loco2 we care deeply about building an inclusive, open and supportive work environment. We behave with respect for people and the planet and are seeking a diverse range of candidates that share these values.</p>\n\n<p><strong>About us</strong></p>\n\n<p>We're a <a href=\"https://loco2.com/team\">small, passionate and cosmopolitan team</a>, with a healthy remote-first culture and an office in London. Our success is built on trust, empathy and shared knowledge, with our users at the centre of what we do. <a href=\"https://uk.trustpilot.com/review/loco2.com\">We're proud to have an average rating of 9.3 out of 10 on Trustpilot</a> after 22,000 reviews.</p>\n\n<p>We’ve been selling tickets since 2012 (read our <a href=\"https://loco2.com/our-story\">full story here</a>), and we’re growing rapidly as the business matures. Our goal is to scale effectively whilst continuing to delight our users.</p>\n\n<p><em>Why join us?</em></p>\n\n<ul>\n<li>We have high codings standards, and follow best practices such as continuous testing and delivery</li>\n<li>We strive to learn and improve together in a supportive environment as the wider tech ecosystem evolves</li>\n<li>Our team enjoys a healthy work-life balance and don’t think caffeine-fuelled all-nighters are a good way to grow a company that’s built to last</li>\n<li>We offer flexible hours and a well-designed remote working culture built on trust. Work around your schedule and when you’re most productive</li>\n<li>Our days are not full of meetings and needless distractions, allowing others to achieve flow is a big part of supporting each other</li>\n<li>Everyone is encouraged to ask questions, think creatively and suggest new working practices. We have a small team so your voice will be heard</li>\n<li>You will be provided with a laptop and are empowered to make changes that improve your working environment</li>\n</ul><p><strong>Technical challenges</strong></p>\n\n<p>Our software stack consists of a pure-Ruby backend library which we use to communicate with train booking APIs, a modern Rails application, a PostgreSQL database, and two native mobile applications (iOS and Android).</p>\n\n<p>We’re integrated with multiple rail operator booking systems (with our current team we usually complete at least 1-2 major integrations each year), and we’re increasingly consuming other types of data too (e.g. timetable data for routing, real-time arrivals/departures etc).</p>\n\n<p>We need to diligently manage technical complexity, as each external system works in a slightly different way, with its own features and quirks. SOAP is (unfortunately) used by many operator APIs, which is why we released our open source library, <a href=\"https://github.com/loco2/lolsoap\">LolSoap</a>.</p>\n\n<p>Some of the most difficult challenges we face relate to routing and making sense of lots of data. Which routes are best to get from A to B? Which booking systems should be queried? How might we cache data without affecting accuracy of results?</p>\n\n<p>We’ve recently released mobile applications for iOS and Android. Further developing our mobile strategy is a key goal for the business.</p>\n\n<p>Because Loco2 is the merchant of record for all transactions we are also responsible for fraud prevention, and handling currency and other finance-related issues.</p>\n\n<p>We frequently release new features that drive rapid organic growth, and so it’s vital that we anticipate and address scaling challenges before they occur.</p>\n\n<p><strong>About you</strong></p>\n\n<p>An ideal candidate:</p>\n\n<ul>\n<li>Has 4+ years of professional programming experience</li>\n<li>Has deep knowledge and experience of Ruby</li>\n<li>Is fluent in English and confident communicating and sharing complex information and learnings with both technical and non-technical team members</li>\n<li>Has a good working knowledge of modern devops technologies such as Docker</li>\n<li>Is comfortable designing object oriented software from scratch, not just implementing CRUD Rails apps; a pragmatist who can see the trade-offs involved in the different approaches to solving a problem</li>\n<li>Strives to discover and understand the root cause of problems, suggesting new and improved solutions, rather than treating the symptoms</li>\n<li>Actively considers future maintainability when deciding how to implement something</li>\n<li>Has a keen appetite for self-improvement and growth, but doesn't hesitate to ask for help when needed</li>\n<li>Enjoys getting their teeth stuck into complicated problems, as well as being willing to pitch in on some of the more routine tasks which inevitably arise</li>\n<li>Is willing to participate in an on-call rota to cover technical emergencies out of hours</li>\n<li>Can work hours that have some overlap with London daytime</li>\n<li>Is motivated by Loco2's mission</li>\n</ul>","how_to_apply":"<p>Email <a href=\"mailto:jobs@loco2.com\">jobs@loco2.com</a> and tell us about your skills and experience, plus include links to any relevant public repositories. You can send a CV if you want, but we particularly like reading a well-written email instead/as well.</p>\n\n<p><strong>Unfortunately we can currently only accept applications from within the EU (including the UK).</strong></p>\n\n<p>There are some specific questions we'd like you to answer (feel free to be brief if you’d prefer to elaborate in other areas):</p>\n\n<ol>\n<li>What are some of the most challenging/interesting programming tasks you have worked on?</li>\n<li>Why do you want to work for Loco2?</li>\n<li>What country and timezone do you live in?</li>\n<li>What are your approximate salary expectations? (please state currency)</li>\n</ol><p>We welcome applications from everybody, regardless of race, gender, or sexual orientation.</p>\n\n<p>To try to make the hiring process as fair as possible, if we are interested in your application, then you'll be asked to complete a programming challenge which is judged anonymously. We deliberately anonymise responses to this task in order to mitigate any inherent biases in this regard.</p>\n\n<p>Our emphasis is on finding somebody with demonstrable skills rather than somebody who is good at self-marketing. This process helps us focus on that.</p>\n\n<p><em>Please note that we do not respond to approaches from recruitment agencies, and emails will be marked as spam.</em></p>","company":"Loco2","company_url":"https://loco2.com/en/careers/software-engineer","company_logo":"http://github-jobs.s3.amazonaws.com/2297b50e-083b-11e8-8bc8-5cfdf57c4ca1.png","url":"http://jobs.github.com/positions/a70f5eb8-083b-11e8-80e2-6aeb265cb22e"},{"id":"7abaf9c4-1e31-11e8-86f1-a930540b2ad9","created_at":"Sat Mar 03 15:27:37 UTC 2018","title":"Ruby on Rails / Backend Software Developer (f/m)","location":"Berlin","type":"Full Time","description":"<p>Mobisol Group is a leading global player in decentralised solar electrification. Driven by market demand for off-grid solutions beyond lighting, Mobisol designs, distributes and services large solar systems, seamlessly integrated with proprietary pay-as-you-go (PAYG) software. By combining the latest high-tech solar hardware with mobile payment technologies, the Berlin based company ensures affordability through flexible payment plans. Mobisol enables rural families and businesses to power a wide range of compatible appliances, such as televisions and stereos, thereby improving people's standard of living and enabling incremental income from new solar-powered businesses. With over 750 employees, Mobisol runs its own operations in Tanzania, Kenya and Rwanda, while providing hardware and software solutions through a growing network of B2B partnerships in another nine countries worldwide.</p>\n\n<p><strong>WHAT THIS JOB IS ABOUT</strong></p>\n\n<p>As Backend Software Developer you are developing and improving the core of PAYGEE, Mobisol’s business software platform. All information, which flows between customers, solar systems, partners and our employees in Berlin and East Africa are managed and shaped by various web and mobile applications.</p>\n\n<p>It will be your task within a team of experienced and self-driven developers to put your fingerprint on the platform that drives Mobisol to deliver the best service and products to our rural customers in East Africa.</p>\n\n<p><strong>YOUR TASKS</strong></p>\n\n<p>Together with our international Software Development Team you:</p>\n\n<ul>\n<li>Push our product further – develop new features together with stakeholders across all Mobisol departments and sites</li>\n<li>Upgrade our existing software – re-design and refactor existing software infrastructure to meet new business or performance requirements</li>\n<li>Be a key player in our team – take an active part in the development team's processes</li>\n<li>Holding the strings together – implement interfaces with external and mobile software infrastructure</li>\n</ul><p><strong>YOUR QUALIFICATIONS</strong></p>\n\n<ul>\n<li>You have the passion for discovering, evaluating and implementing new technical solutions for Mobisol´s vision to plug in the world!</li>\n<li>You have an in-depth understanding of high level software mechanisms, and best practices</li>\n<li>You have a clear understanding of software architecture and design of web applications especially backend, frontend experience is a plus</li>\n<li>You are experienced with Ruby On Rails and how to deal with it’s limitations</li>\n<li>You prefer to work with the *nix based operating systems</li>\n<li>You are experienced with agile software development team processes</li>\n<li>You love to learn from your new colleagues and share your knowledge with them</li>\n<li>You already gained intercultural competence, ideally with work experience abroad\n\n<ul>\n<li>Professional level of English, German or Swahili language skills are considered as an asset</li>\n</ul>\n</li>\n</ul><p><strong>Our Tech Stack</strong></p>\n\n<ul>\n<li>Ruby 2.4, Rails 5 and 4.1 w/ ActiveAdmin, Grape</li>\n<li>MySQL, MongoDB, Cassandra, Redis</li>\n<li>SOA around the Middleware using Kafka</li>\n<li>Monolith around the frontend which needs modularization</li>\n<li>Frontend: HAML, SASS, vue.js and Angular with regular JS</li>\n</ul><p><strong>YOUR PERSPECTIVE</strong></p>\n\n<ul>\n<li>Doing something meaningful – you´ll be part of an enterprise that brings real positive impact to ordinary people in East Africa</li>\n<li>Personal development – beside new experiences of developing in an international context with new technologies, we support you with possibilities for participation in Hackathons, developer conferences and classical trainings</li>\n<li>Be part of a great team of people – who combine professional expertise with individual passion\nFlat hierarchies and unusual ways to do things – your ideas and experiences are more than welcome</li>\n</ul><p><strong>HOW TO APPLY</strong></p>\n\n<p>Important for us are your skills and your motivation rather than certificates or university degrees. Please apply via our job portal. if you have further questions don´t hesitate to\ncontact:</p>\n\n<p>David Senftleben – Phone: +49 30/ 9700 - 2556 – e-Mail: <a href=\"mailto:jobs@plugintheworld.com\">jobs@plugintheworld.com</a></p>\n\n<p><img src=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=957560e3-d07c-40ed-aa44-84167fcd3773&amp;pid=3dca8803-3103-4ee3-8587-a0d0f0f5dde0&amp;ec=view%3Apixel&amp;cb=https%3A%2F%2Fs3-eu-west-1.amazonaws.com%2Fgohiring-public-assets%2Fpixel.gif\" alt=\"GoHiring\"></p>","how_to_apply":"<p><a href=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=957560e3-d07c-40ed-aa44-84167fcd3773&amp;pid=3dca8803-3103-4ee3-8587-a0d0f0f5dde0&amp;ec=click%3Aapply_url&amp;cb=https%3A%2F%2Fmobisol-jobs.personio.de%2Fjob%2F59741%23apply\">application form</a></p>","company":"Mobisol","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/52855652-1e31-11e8-94fe-d1405ad8e995.jpg","url":"http://jobs.github.com/positions/7abaf9c4-1e31-11e8-86f1-a930540b2ad9"},{"id":"c2e09ab6-1ed0-11e8-8330-41ecd8be32bb","created_at":"Sat Mar 03 10:59:36 UTC 2018","title":"Woocommerce with digital downloads and subscription access","location":"Remote","type":"Contract","description":"<p>We have a need for a site that will have two dimensions to it- a digital downloads section (research reports in PDF) and a second part of subscrption based access to daily research content. Looking for a developer with specialised experience in above (as against plain vanillla e-commerce). The digital downloads are based on one-off payments in advance- the PDF reports are priced individually and the site user will select and then add reports to shopping cart from a palette of reports.  The same site in one corner will provide a link to separately hosted site. Access to this would be on a one-off annual subscription payment.  The site needs to be built from scratch but some features analysis and very basic wireframes have been attempted by a Business Analyst and her support will be available to the developer.</p>","how_to_apply":"<p>Email to <a href=\"mailto:hiring@finnovate.com\">hiring@finnovate.com</a></p>","company":"Finnovate Limited","company_url":"http://www.finnovate.com","company_logo":null,"url":"http://jobs.github.com/positions/c2e09ab6-1ed0-11e8-8330-41ecd8be32bb"},{"id":"a736ad96-1e71-11e8-9a9e-5fed54a084df","created_at":"Fri Mar 02 23:30:12 UTC 2018","title":"Siri - Open Source Technologies Engineer","location":"Cupertino, CA","type":"Full Time","description":"<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Siri Open Source Technologies team is focused on the progression of several open source technologies used within Siri. These technologies are instrumental to the success of the Siri platform. You will be exposed to projects such as HBase, HDFS, Kafka, Spark, and ZooKeeper at a scale that will test the limits and expose flaws only seen at Apple’s scale. You will commit/contribute to these projects and build a continuous integration pipeline to test, validate, maintain, and patch issues in order to commit back upstream. This will allow Siri to continue to live on the bleeding edge of these technologies and further the performance for our customers.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>3+ years experience as a contributor or committer</li>\n<li>Industry experience in similar roles at large scale companies</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Strong understanding of continuous integration and the infrastructure to support it</li>\n<li>Experience in system design/architecture and implementation</li>\n<li>Expert programming skills with committer rights on one or more Apache project(s)</li>\n</ul><p>Description:\nThe Siri Open Source Technologies team is in a unique position to help push how Siri leverages open source. These contributions will also help other teams within Apple who utilize similar technology stacks. The work executed by this team will be used in production supporting millions of customers in real-time. The team will also be strengthening Siri’s data analytics platform for machine learning and ad-hoc analytics by fixing critical problems in projects such as Kafka and HDFS.</p>\n\n<p>A successful candidate will have experience with the Apache Hadoop stack and the development environment necessary to support it.</p>\n\n<ul>\n<li>Create and manage internal repositories for all open source projects used in Siri</li>\n<li>Build out supporting infrastructure to handle continuous integration</li>\n<li>Implement testing frameworks for pre-Siri adoption</li>\n<li>Define workflow for upgrading versions without service interruption</li>\n<li>Develop new tooling for interacting and maintaining open source projects</li>\n<li>Contribute/commit critical fixes to open source projects both external and internal to Apple</li>\n</ul><p>Education:\nB.S. degree in Computer Science and 3+ years of programming experience or equivalent.</p>\n\n<p>Additional Requirements:\n(Nice to have items)</p>\n\n<p>Knowledge of core Linux fundamentals\nScripting skills (Python, Bash, Ruby, etc.)\nExperience with compute containerization (i.e. - Mesos, Docker, schedulers)</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113424290\nCOMPANY NAME: Apple Inc.</p>","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=9da2d5571de99e38539d46ad3b9e27c6\">APPLY URL</a></p>","company":"Apple Inc.","company_url":"http://www.apple.com","company_logo":"http://github-jobs.s3.amazonaws.com/7e52779e-1e70-11e8-9f28-0ebd59c82620.jpeg","url":"http://jobs.github.com/positions/a736ad96-1e71-11e8-9a9e-5fed54a084df"},{"id":"de1e2e4c-05ee-11e8-8bd7-141af965a1d0","created_at":"Fri Mar 02 23:09:11 UTC 2018","title":"Software Engineer, Platform","location":"Denver, CO","type":"Full Time","description":"<p>About VigLink:</p>\n\n<p>At VigLink, we believe the future of marketing lies within the untapped potential of digital content covering commercial products across the Web. We empower influential publishers who produce this content to connect enthusiastic consumers with the products they love from the brands who value them the most. We accomplish this directly through publishers’ words, without need for an ad.</p>\n\n<p>By identifying commercial products mentioned within a publisher’s content, VigLink automatically invigorates those terms by transforming them into hyperlinks whose destinations are determined in real-time, advertiser-bid auctions. Yes, hyperlinks, the defining feature of the Web from the very start. The literal “H” in HTML. Every time a clicked link takes a person from one destination to another, value is created. However, that value has never been fairly priced or available for purchase at scale. Until now.</p>\n\n<p>Founded in 2009, VigLink is located in heart of San Francisco and backed by top investors including Google Ventures, Emergence Capital, and RRE. VigLink manages a publisher network of over 2 million sites and apps, as well as an advertiser network of over 70,000 brands and merchants.</p>\n\n<p>About the role:</p>\n\n<p>VigLink is seeking a dynamic software engineer to join our Platform team. At VigLink we love go-getters and are looking for an hands-on software engineer working on a java web application development platform who enjoys working with Product Managers and Business teams to solve complex problems. </p>\n\n<p>Specific responsibilities include:</p>\n\n<p>Developing large, complex web-based distributed applications using core Java and established frameworks <br>\nAnalyzing requirements and designing scalable solutions to handle large data volume while producing and testing build artifacts <br>\nDesigning and implementing RESTful APIs for consumption by internal and external teams utilizing established web protocols to build fault-tolerant distributed systems <br>\nDeveloping and utilizing automated test suites that validate API components performance at a scale using CI pipelines in Jenkins <br>\nDeploying production software using AWS tools and APIs and monitoring production systems to ensure that they continue to run as designed and expected and modify existing software to correct errors and improve its performance <br></p>\n\n<p>Technical Experience</p>\n\n<p>Candidates should be able to demonstrate technical expertise in some of the following technologies: Java, Hibernate, Spring MVC, SQL, Cassandra, Javascript, Elastic Search, Kafka, Redshift, HTML5, Flex, RESTful web services, AWS and experience building software with Test Driven Development (TDD) methodology using JUnit/TestNG and JMeter.</p>\n\n<p>Required qualifications:</p>\n\n<p>1-4 years significant experience as a software engineer in a production software development environment<br>\nDetailed knowledge of core Java and established frameworks<br>\nPrior experience with Cassandra, ElasticSearch, data warehouse technical architectures, ETL and reporting/analytic tools and environments is preferred<br>\nExperience in relational database concepts with knowledge of MySQL / RDS<br>\nA bachelor’s or higher degree in an analytical area such as computer science, physics, mathematics, statistics, or engineering<br>\nExperience in the e-commerce, web analytics, search, and cloud-computing space<br></p>\n\n<p>VigLink Values</p>\n\n<p>At VigLink we have a great company culture where mission and values are clear, communicated often, and embraced.</p>\n\n<p>Dare<br></p>\n\n<p>Overcome<br></p>\n\n<p>Challenge<br></p>\n\n<p>Collaborate<br></p>\n\n<p>Play<br></p>\n\n<p>Our perks &amp; benefits include:</p>\n\n<p>Unlimited vacation time<br>\nFull medical, dental and vision coverage<br>\n401(k) plan<br>\nCatered lunches twice a week<br>\nWeekly happy hour<br>\nA tasty snack &amp; beverage pantry<br>\nCompany gatherings and outings<br>\nMass transit and parking flexible spending accounts<br>\nWork From Home (WFH) eligibility after a minimum of 3 months at the company<br>\nWe’re also closed on all major holidays, including an extended winter break!<br>\nRelocation and travel expenses not covered</p>","how_to_apply":"<p>Apply on our website! \n<a href=\"https://www.viglink.com/about/careers/\">https://www.viglink.com/about/careers/</a></p>","company":"VigLink","company_url":"https://www.viglink.com/","company_logo":"http://github-jobs.s3.amazonaws.com/bc0a6794-05ee-11e8-902a-778405599bdb.png","url":"http://jobs.github.com/positions/de1e2e4c-05ee-11e8-8bd7-141af965a1d0"},{"id":"389af97e-05ed-11e8-9b34-c6d5805d4686","created_at":"Fri Mar 02 23:08:00 UTC 2018","title":"Senior Software Engineer, Platform","location":"San Francisco","type":"Full Time","description":"<p>About VigLink:</p>\n\n<p>VigLink sits on the confluence of the ad-tech ecosystem, being in a unique position where we manage both publishers and merchants, and with it, a dynamic suite of products. Our technology automatically works to monetize content found on the web, mobile platforms and apps. We are headquartered in the heart of San Francisco, with multiple offices located across the continental United States and are backed by top investors including Google Ventures, Emergence Capital, and RRE. VigLink manages a growing publisher network of over 300,000 sites and apps, as well as an expanding advertiser network of over 40,000 brands and merchants. Our systems process hundreds of millions of requests per day on top of a cutting-edge tech stack including technologies such as Cassandra, Elasticsearch, Spark, Kafka, etc.</p>\n\n<p>About the role:</p>\n\n<p>VigLink seeks a Senior Software Engineer to join our Platform team as we expand our core suite of products and scale out our infrastructure to meet increasing demands of new traffic. You will get to work on products that millions of users view and interact with on a daily basis. We are a small team that emphasizes on moving fast and delivering impactful products through technical excellence. You will be given opportunities to grow in technical leadership and gain experience and exposure across our advanced tech stack, as well as drive initiatives to improve the business and platform.</p>\n\n<p>Responsibilities: </p>\n\n<p>Back-end product/systems development with AWS, using Java and Scala <br>\nDesign and build robust, web-based, distributed applications that can scale to handle tens of thousands of requests per second <br>\nLead projects across large volumes of code, with multiple branches, formal integration procedures and test cycles <br>\nContribute software engineering best practices and technical excellence through code reviews and mentorship of junior engineers <br>\nDemonstrate end-to-end ownership of projects and initiatives</p>\n\n<p>You will be a great fit if:</p>\n\n<p>You love technical challenges and solving problems <br>\nYou embrace technical excellence and strive to make better software and products <br>\nYou are a team player but yet independent in terms of getting things done <br>\nYou enjoy being part of a great team that works well and plays well together</p>\n\n<p>Qualifications</p>\n\n<p>4+ years significant experience as a software engineer in a formal product development environment <br>\nHighly proficient in Java, Spring, SQL, and relational databases (MySQL, RDS) <br>\nExpertise in one or more of the following areas: AWS, Cassandra, Elasticsearch, Spark, Kafka, Microservice architectures, Data Warehouse technical architectures (Redshift), RESTful web services <br>\nExtensive experience leading design and implementation of highly available and scalable, complex Web systems using Test Driven Development (TDD) and in an Agile setting <br>\nMaster’s or higher degree in an analytical area such as computer science, physics, mathematics, statistics, or engineering or equivalent experience <br>\nExperience in the ecommerce, web analytics, search, and cloud computing space</p>\n\n<p>VigLink Values</p>\n\n<p>At VigLink we have a great company culture where mission and values are clear, communicated often, and embraced.</p>\n\n<p>Dare <br>\nOvercome <br>\nChallenge <br>\nCollaborate <br>\nPlay</p>\n\n<p>Our perks &amp; benefits include:</p>\n\n<p>Unlimited vacation time <br>\nFull medical, dental and vision coverage <br>\n401(k) plan <br>\nCatered lunches twice a week <br>\nWeekly happy hour <br>\nA tasty snack &amp; beverage pantry <br>\nCompany gatherings and outings <br>\nMass transit and parking flexible spending accounts <br>\nWork From Home (WFH) eligibility after a minimum of 3 months at the company <br>\nWe’re also closed on all major holidays, including an extended winter break!</p>","how_to_apply":"<p>Apply on our website!\n<a href=\"https://www.viglink.com/about/careers/\">https://www.viglink.com/about/careers/</a></p>","company":"VigLink","company_url":"https://www.viglink.com/","company_logo":"http://github-jobs.s3.amazonaws.com/1ba5f918-05ed-11e8-9a8a-073936c20249.png","url":"http://jobs.github.com/positions/389af97e-05ed-11e8-9b34-c6d5805d4686"},{"id":"f00dc824-ec35-11e7-99e6-bcbf86ad3b8e","created_at":"Fri Mar 02 23:05:31 UTC 2018","title":"Senior Data Scientist / Machine Learning Engineer","location":"San Francisco","type":"Full Time","description":"<p>About VigLink:</p>\n\n<p>At VigLink, we believe the future of marketing lies within the untapped potential of digital content covering commercial products across the Web. We empower influential publishers who produce this content to connect enthusiastic consumers with the products they love from the brands who value them the most. We accomplish this directly through publishers’ words, without need for an ad.</p>\n\n<p>By identifying commercial products mentioned within a publisher’s content, VigLink automatically invigorates those terms by transforming them into hyperlinks whose destinations are determined in real-time, advertiser-bid auctions. Yes, hyperlinks, the defining feature of the Web from the very start. The literal “H” in HTML. Every time a clicked link takes a person from one destination to another, value is created. However, that value has never been fairly priced or available for purchase at scale. Until now.</p>\n\n<p>Founded in 2009, VigLink is located in heart of San Francisco and backed by top investors including Google Ventures, Emergence Capital, and RRE. VigLink manages a publisher network of over 2 million sites and apps, as well as an advertiser network of over 70,000 brands and merchants.</p>\n\n<p>About the role:</p>\n\n<p>VigLink is seeking a Data Scientist or Machine Learning Engineer with strong Hadoop, Hive and SQL skills, and experience creating production-quality code in Python, R, or other related languages. We are looking for folks who enjoy working on a variety of different types of analyses, ranging from ad-hoc \"data wrangling\" tasks through the creation of full-blown programs to calculate business-critical, customer-visible values on an ongoing basis, enjoy thinking through a data problem, understanding the customer needs associated with it, and working on your own and with other developers to create a pragmatic solution.</p>\n\n<p>At VigLink we love go-getters and people who like working in an Agile, best-practices environment - who understand the importance of testable, modular, efficient code, so that's what you write.</p>\n\n<p>Required Qualifications:</p>\n\n<p>Minimum of 3 years experience in relevant analytics tasks with strong Python, R, Matlab, or related language<br>\nExperience training and implementing supervised and/or unsupervised learning models <br>\nSolid understanding of databases and SQL<br>\nCapacious curiosity for data and algorithms, and how to apply them to create insight<br>\nExperience with Linux/Unix—you are comfortable on the command line<br>\nExperience in the e-commerce, web analytics, search, and cloud computing space<br>\nBA/BS degree in Computer Science preferred with a strong academic record (MS/PhD or equivalent a plus)</p>\n\n<p>Preferred Qualifications:</p>\n\n<p>NLP experience particularly with concepts such as document classification, named entity recognition/disambiguation, and topic modelling<br>\nExperience with Java, or a JVM based language like Scala<br>\nExperience with the Hadoop ecosystem, particularly Pig and Hive</p>\n\n<p>A few fun problems we're working on:</p>\n\n<p>Feature Extraction and Context / Product Inference\nIdentify the commercial context of publisher content, identify the relevance of commercial links to that content, and match relevant destinations to appropriate products / services available across the web.</p>\n\n<p>Statistical Modeling and Prediction of Earnings\nModel the performance of our existing publishers and merchants to predict future performance at high granularity.</p>\n\n<p>Large-Data Analytics and Audience Profiling\nDevelop automated insights that help publishers improve their performance by developing a better understanding of their audiences based on billions of impressions and tens of millions of clicks per week. Do this for thousands of publishers in a scalable and relevant way.</p>\n\n<p>Destination Optimization\nSelect the most appropriate destination for a commercial link, based on what is best for the viewer and the publisher. Balance estimated publisher earnings (based on earnings per click, location, device type, etc) with viewer relevance and good viewer experience.\nRelocation and travel expenses not covered.  </p>\n\n<p>VigLink Values</p>\n\n<p>At VigLink we have a great company culture where mission and values are clear, communicated often, and embraced.</p>\n\n<p>Dare<br>\nOvercome<br>\nChallenge<br>\nCollaborate<br>\nPlay</p>\n\n<p>Our perks &amp; benefits include:</p>\n\n<p>Unlimited vacation time<br>\nFull medical, dental and vision coverage<br>\n401(k) plan<br>\nCatered lunches twice a week<br>\nWeekly happy hour<br>\nA tasty snack &amp; beverage pantry<br>\nCompany gatherings and outings<br>\nMass transit and parking flexible spending accounts<br>\nWork From Home (WFH) eligibility after a minimum of 3 months at the company<br>\nWe’re also closed on all major holidays, including an extended winter break!</p>","how_to_apply":"<p>Visit us at <a href=\"http://www.viglink.com/about/careers/\">www.viglink.com/about/careers/</a></p>","company":"VigLink","company_url":"http://www.viglink.com","company_logo":"http://github-jobs.s3.amazonaws.com/9cde85b2-ec35-11e7-9311-8c8553440085.png","url":"http://jobs.github.com/positions/f00dc824-ec35-11e7-99e6-bcbf86ad3b8e"},{"id":"2f5e5cd4-1e66-11e8-8126-6a7d5406bfd3","created_at":"Fri Mar 02 22:08:40 UTC 2018","title":"Lead Software Engineer for Deposit Services","location":"Charlottesville, VA","type":"Full Time","description":"<p>Lead Software Engineer for Deposit Services</p>\n\n<p>The University of Virginia Library seeks a Lead Software Engineer for Deposit Services to create, enhance, and maintain web application services that give patrons access to library resources, with an emphasis on Ruby-on-Rails programming to access Fedora Commons repositories through the Project Hydra stack.</p>\n\n<p>The employee in this position collaborates with team members and other Library developers to support production services and to engage in long term, highly complex programming assignments with significant latitude to devise approaches best suited to project goals. This position joins other information technology staff in contributing to the Library's goal of being a central and responsive partner in the research, teaching, and learning priorities of the University of Virginia.</p>\n\n<p>Qualifications, Required: Bachelor's degree in Computer Science, MIS, Computer Engineering or related discipline. Relevant experience may be considered in lieu of a degree. 4-7 years of demonstrated complex web software design and development experience. Ability to conceptualize a problem and develop technology requirements. Ability to design and develop software. Ability to communicate effectively orally and in writing, with a wide audience. Unix experience.</p>\n\n<p>Preferred: Demonstrated experience developing software with Ruby on Rails. Demonstrated experience developing web server applications. Knowledge of the following: Hydra, SOLR, Fedora, object oriented design, digital object formats, and library metadata standards.</p>\n\n<p>Applicants must apply through the University of Virginia online employment website at <a href=\"https://jobs.virginia.edu/\">https://jobs.virginia.edu/</a>.\nSearch by posting number 0622612, complete the application, and attach a cover letter and resume with contact information for three professional references.</p>\n\n<p>For assistance with this process contact Charlotte Albright, UVA Human Resources Business Partner, at (434) 243-3509 or <a href=\"mailto:cda6b@virginia.edu\">cda6b@virginia.edu</a>.</p>\n\n<p>The University of Virginia is an equal opportunity and affirmative action employer.\nWomen, minorities, veterans, and persons with disabilities are encouraged to apply.</p>\n\n<p>Apply Here: <a href=\"http://www.Click2Apply.net/ks98njwmnw63xjck\">http://www.Click2Apply.net/ks98njwmnw63xjck</a></p>\n\n<p>PI101422989</p>","how_to_apply":"<p>Apply Online</p>","company":"UNIVERSITY OF VIRGINIA","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/2f5e5cd4-1e66-11e8-8126-6a7d5406bfd3"},{"id":"91972990-1e51-11e8-9e92-8568e583cd55","created_at":"Fri Mar 02 19:40:53 UTC 2018","title":"Senior Full Stack Software Engineer ","location":"Remote ","type":"Full Time","description":"<p>CircleCI is looking for an experienced full stack software engineer to help us develop a seamless user experience. You will work closely with Product and Design to ensure developers who interact with CircleCI via the web have a consistent and streamlined experience from the first time they touch the site.</p>\n\n<p>At CircleCI you will be working with a team who values trust, respect, and diversity. We are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are remote friendly, and are looking for people who are passionate about helping shape software engineeringing best practices for the industry as a whole.</p>\n\n<p>To thrive in this role you are someone who works well in teams, and enjoys collaborating. Furthermore you have experience in onboarding, engaging, and retaining users through their journey on various platforms. You enjoy working with Product and Design to find the best solution to the problem at hand, and balance technical tradeoffs with delivering customer value quickly and iteratively. Experience with Growth Engineering a plus.</p>\n\n<p><b>About CircleCI</b></p>\n\n<ul>Velocity is critical for software teams in today's competitive landscape, but maintaining speed can be difficult as apps and systems grow larger and more complex. CircleCI’s platform allows developers to rapidly release code (for web and mobile apps) they trust by automating the build, test, and deploy process. CircleCI enables developers to detect and fix bugs before they even reach customers. Thousands of leading companies including Facebook, Kickstarter, Shyp and Spotify rely on CircleCI to accelerate delivery of their code and enable developers to focus on creating business value fast.</ul><ul>\n<b>About this role:</b>\n<ul>\n<li>Work closely with Product and Design to brainstorm the best way to onboard, engage, and retain customers through the entirety of their user journey</li>\n<li>Build conversion funnels, and the mechanisms to track their success and opportunities for improvement</li>\n<li>Use data to analyze user paths as a way to inform hypotheses about CircleCI’s platform</li>\n<li>Test these hypotheses with mechanisms such as AB testing</li>\n<li>Work in Clojure on the backend, and JavaScript in React on the frontend, on a daily basis</li>\n</ul>\n<p><b>You Have:</b></p>\n\n<ul>\n<li>3+ years of production development experience</li>\n<li>Experience developing single page applications</li>\n<li>Experience working on server side application code\n</li>\n<li>Experience with and appreciation for the functional programming paradigm</li>\n<li>Articulate UI and UX opinions, especially in regards to platforms and funnel dynamics</li>\n<li>Experience verifying or refuting your hypotheses using data</li>\n<li>A deep appreciation for and abilities to support your development with appropriate testing</li>\n<li>Experience with Growth Engineering</li>\n</ul>\n<p><b>You Enjoy:</b></p>\n\n<ul>\n<li>Working in a highly collaborative environment</li>\n<li>Supporting an environment that values trust, respect, and diversity</li>\n<li>Exploring different methods for efficiently delivering code and customer value</li>\n<li>Delivering value to customers</li>\n<li>Sharing your expertise and encouraging best practices</li>\n<li>Utilizing data to inform your opinions</li>\n</ul>\n<p>CircleCI is a Bay Area Best Places to Work 2016 award winner. Founded in 2011 and headquartered in beautiful downtown San Francisco with a global remote workforce, CircleCI is venture backed by Scale Venture Partners, DFJ, Baseline Ventures and Harrison Metal Capital.</p>\n\n<p>We care deeply about diversity and inclusivity. We’re hiring at all experience levels, and seek talented teammates from a wide variety of backgrounds and experiences who are equally committed to cultivating a work environment of respect and kindness. We carefully consider every applicant that takes the time to apply.</p>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/circleci/e7d84f5e-60f7-4c9b-b6a6-5e8ed7926207?lever-origin=applied&amp;lever-source%5B%5D=GITHUB\">https://jobs.lever.co/circleci/e7d84f5e-60f7-4c9b-b6a6-5e8ed7926207?lever-origin=applied&amp;lever-source%5B%5D=GITHUB</a></p>","company":"CircleCI","company_url":"http://www.circleci.com ","company_logo":"http://github-jobs.s3.amazonaws.com/8737cfae-1e51-11e8-84cd-f13f80dc8bfd.jpg","url":"http://jobs.github.com/positions/91972990-1e51-11e8-9e92-8568e583cd55"},{"id":"037fa17c-1e48-11e8-9be6-29a2d796edb1","created_at":"Fri Mar 02 18:32:43 UTC 2018","title":"Backend Web Developer (Node)","location":"Los Angeles, CA","type":"Full Time","description":"<p><strong>Who We Are</strong></p>\n\n<p>ScaleLab is a leading digital talent network on a mission to help online influencers expand their audience and overall career through technology and top-level agency services. We represent thousands of established social media stars and pride ourselves on providing each of them with the tools, support, community and resources they need to grow on and beyond the digital platforms they’ve mastered. Developing cutting-edge technology that utilizes years of industry experience combined with the enormous amounts of data provided by our large client-base is the core of the future of our company. This is where you come in!</p>\n\n<p><strong>Who are we looking for</strong></p>\n\n<p>Are you a type of person who loves to dive into a new technology stack? Are you self-motivated to explore and embrace new trends, routines, and technology? Do you love to work in a small and productive team? </p>\n\n<p>We are looking for an experienced, LA-based Backend Engineer who will play a key role in ScaleLab’s vision for an integrated experience for brands and influencers. You will be a part of a small, highly-collaborative engineering team building a new product that’s meant to revolutionize the influencer marketing industry.  </p>\n\n<p><strong>Requirements</strong></p>\n\n<ul>\n<li>5+ years of back end development (Node)</li>\n<li>Strong critical thinking and problem solving skills, motivation, and passion</li>\n<li>Expert level ES6/7 JavaScript with Koa/Express frameworks</li>\n<li>Practical experience building and consuming RESTful APIs</li>\n<li>Strong knowledge of SOLID (object-oriented design), and Object-relational mapping</li>\n<li>Experience in SOA (Service-oriented architecture)</li>\n<li>Strong MySQL knowledge (table design, complex query creation, best practices)</li>\n<li>Solid understanding of the full web technology stack (e.g. HTTP, cookies, asset loading, caching, REST)</li>\n<li>Solid fundamental understanding of testing (including stubbing, functional, unit, and e2e)</li>\n<li>Experience using CI/CD tools and systems such as Jenkins, Hudson, GitLab, GitHub, etc.</li>\n<li>Experience with Websockets is a plus</li>\n</ul><p><strong>Responsibilities</strong></p>\n\n<ul>\n<li>Design, develop, and maintain various backend APIs using Node and Koa</li>\n<li>Write and maintain clean, well-written, test-driven JavaScript code and documentation conforming to standards</li>\n<li>Troubleshoot, identify and resolve API performance problems</li>\n<li>Optimize database schema, queries, and caching</li>\n<li>Collaborate with peers on best practices and promote knowledge sharing</li>\n<li>Release early, release often</li>\n</ul>","how_to_apply":"<p>Please apply <a href=\"https://scalelab.com/en/careers/backend-web-developer-node\">here</a></p>","company":"ScaleLab","company_url":"http://scalelab.com","company_logo":"http://github-jobs.s3.amazonaws.com/a4b23ba6-1e46-11e8-8c7d-44b5abe23baa.png","url":"http://jobs.github.com/positions/037fa17c-1e48-11e8-9be6-29a2d796edb1"},{"id":"cb5e5ca2-1e29-11e8-8d08-9126586c0f5c","created_at":"Fri Mar 02 14:57:09 UTC 2018","title":"Software Engineer ","location":"Paris - France ","type":"Full Time","description":"<p>1000mercis helps customers collect, analyze and leverage their data across all marketing channels.\nTo do this, we are more than 100 engineers (a quarter of 1000mercis) divided into teams with a human dimension. We accompany each person to develop a positive influence and be autonomous.\nOur sustained growth pushes us to constantly challenge our technical and organizational choices.</p>\n\n<p><strong>Responsibilities</strong></p>\n\n<p>Due to our wide range of interconnected products, our technical issues are very varied and often complex.\nOur daily missions are to process thousands of queries distributed around the world per second, operate multiple petabytes databases (Big Data™), automate our entire bare-metal infrastructure, and build tomorrow's digital marketing interfaces.</p>\n\n<p><strong>Profile</strong></p>\n\n<ul>\n<li>Strong IT culture and technical curiosity</li>\n<li>Thorough knowledge in at least one back-end and/or front-end stack</li>\n<li>Interest in databases, the world of open-source, and/or DevOps culture</li>\n<li>Good communicator, able to popularize work, defend ideas and listen to others</li>\n<li>Willingness to progress and to help others progress, technically (meetups, internal training) and humanly</li>\n<li>Good experience using Python and/or Javascript is a plus</li>\n<li>Daily use of Linux is very preferable but not required</li>\n<li>Professional English (our teams are international)</li>\n</ul><p><strong>About 1000mercis group</strong></p>\n\n<p>The story began in a kitchen in the year 2000, then it's the IPO followed by acquisitions, a double-digit growth and here we are!\nWe are pioneers of Data Marketing, recognised experts in digital CRM and Programmatic Marketing. We handle everything from data collection to activation on all digital platforms (mobile, desktop, tablets and connected objects).</p>\n\n<p>As of today, we are a strong team of 400 employees. Based in San Francisco, New York, London, Dubai, Amsterdam, Tel Aviv. Our R&amp;D focused teams are based in Paris.</p>\n\n<p>Alongside Alternext (ALMIL.PA), 1000mercis devotes more than 10% of its turnover to R&amp;D, particularly in the field of machine learning, and has won the \"Innovative Company\" qualification of BPI France.\nJoin our success story.\nMore information on <a href=\"http://www.1000mercis.com\">www.1000mercis.com</a>.</p>","how_to_apply":"<p>Email your resume to <a href=\"mailto:marguerite@1000mercis.com\">marguerite@1000mercis.com</a></p>","company":"1000mercis group","company_url":"https://www.1000mercis.com","company_logo":"http://github-jobs.s3.amazonaws.com/ff09e7fc-1e28-11e8-9c0e-f85f5f0f76d3.png","url":"http://jobs.github.com/positions/cb5e5ca2-1e29-11e8-8d08-9126586c0f5c"},{"id":"f627e298-1da0-11e8-9e4b-ca05176d6b22","created_at":"Thu Mar 01 22:38:08 UTC 2018","title":"Software Engineer","location":"Philadelphia","type":"Full Time","description":"<p>Overview</p>\n\n<p>Azavea is a civic technology firm based in Philadelphia that uses geospatial data to build software and data analytics for the web.  As a B Corporation, our mission is to use advanced geospatial technology for civic, social, and environmental impact. Most of our work deals with local governments, non-profit organizations, and academic or federal research projects.  We build custom web applications, perform geospatial analysis, and contribute to open source projects.  Our engineers work across the technology stack, from modern browser-based front-ends to robust service-based backends residing on scalable infrastructure.</p>\n\n<p>We are looking for a Software Engineer who is passionate about building and operating applications that will have a positive impact. Ideal candidates are interested in public service, but not necessarily in working for a government or a non-profit organization.</p>\n\n<p>We’re excited about what we do, we’re growing, and we hope you will join us.</p>\n\n<p>Skills &amp; Requirements</p>\n\n<p>Azavea has five software teams, all of which develop web software for processing and visualizing geospatial data.  The teams differ in terms of the specific projects they develop and whether they are primarily product or service focussed. The GeoTrellis team develops an open source software framework that enables low latency, distributed processing of geospatial data; the majority of our work is currently funded by the U.S. Federal government. The project is based on Scala and Apache Spark. It is used in many types of web applications, including processing satellite imagery, climate change, precision agriculture, public transit travel-sheds, and watershed modeling. GeoTrellis is a member of the Eclipse Foundation’s LocationTech working group. A significant focus of the past year has been developing Python Bindings in an effort to expand the pool of developers that can benefit from GeoTrellis. GeoTrellis is growing, and we need your help to expand the framework and make it more useful to other developers.</p>\n\n<p>What You’ll Do\nBuild scalable back-end software where performance is critical.\nImplement new features, algorithms, data processing operations, benchmarks and tests for a large Scala-based software framework.\nEngage in multidisciplinary work that applies an agile process (scrum board, daily stand-ups and two-week iterations) to design, architecture, development, testing and deployment.\nSupport the development of an open source community around the GeoTrellis project.\nContribute to both a growing company and to the open source communities that support our work.</p>\n\n<p>You should\nDemonstrate fluency with at least one functional programming language such as Scala, Clojure or Haskell.\nBe able to adapt and lean in order to keep innovating on a cutting edge open source project.\nHave experience with Amazon Web Service  or another cloud-based architecture.\nInterested in working with a small, collaborative team on meaningful projects.\nGet excited about contributing to a large, complex open source project.</p>\n\n<p>You get extra points for\nExperience with Spark, Akka, or other Scala-based distributed processing frameworks.\nHaving worked with distributed data processing frameworks, like Hadoop, Amazon MR, etc.\nDemonstrating your open source or other community service contributions.\nStrong background in algorithm development where performance is critical.</p>\n\n<p>You’ll notice that we don’t cite N years of experience or a Computer Science as requirements.  Formal credentials like these are valuable, but we are primarily looking for people who have gained real-world experience successfully building sophisticated web applications.  </p>\n\n<p>Office and Benefits</p>\n\n<p>Our Philadelphia headquarters is located in a brightly lit office on the 5th floor of a converted factory building in the Callowhill neighborhood, a short walk from Center City, the Reading Terminal Market, and SEPTA subway and regional rail stations. For bicyclists, we have in-house bike parking, a shower and lockers.  The office itself is assembled as an open office plan with several smaller rooms for team meetings and concentration time.  You get your own desk with a high-end Linux workstation or Apple laptop and extra monitors.  We have flex-time to deal with personal stuff, and most people work a 40 - 45 hour week on a regular schedule.  After the first six months, our staff can also spend up to 10% of their time on an open source, professional development, or R&amp;D project.  Recent 10% time projects include experiments with machine learning, Python 3, Reactive Native, and various forms of serverless processing with Amazon Lambda.</p>\n\n<p>We offer a salary commensurate with skills and experience and a benefits package that includes:\nFully subsidized health care, dental, prescription plan, including for spouse/partner and children\nFully subsidized life and long term disability insurance, plus voluntary short term disability insurance\nMedical reimbursement plan to cover what the health insurance does not\nRetirement plan with matching percentage\nAlmost 4 weeks paid vacation plus additional paid sick/personal time off\nFamily and medical leave\nFlexible work schedule\nPaid maternity and paternity leave\nChild care subsidy\nPaid time off for voting and volunteering\nEducation assistance plan\nStudent loan assistance\nPublic transit and biking reimbursement plans\nMonthly guest lectures with lunches on the house\n10% time for research or learning projects\nProfit-sharing bonus plan\nFinancial transparency through an open book policy\nKind, capable and thoughtful colleagues</p>\n\n<p>We welcome qualified candidates from all walks of life and value diversity in our company. We prohibit discrimination based on race, color, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, veteran status, military service, disability unrelated to job requirements, marital status, or domestic partner status.</p>","how_to_apply":"<p><a href=\"https://hire.withgoogle.com/public/jobs/azaveacom/view/P_AAAAAADAAADPCSc_a1ZnPl?trackingTag=gitHubJobs\">https://hire.withgoogle.com/public/jobs/azaveacom/view/P_AAAAAADAAADPCSc_a1ZnPl?trackingTag=gitHubJobs</a></p>","company":"Azavea","company_url":"http://Azavea","company_logo":"http://github-jobs.s3.amazonaws.com/e81877b2-1da0-11e8-9e17-4c005e6832d9.png","url":"http://jobs.github.com/positions/f627e298-1da0-11e8-9e4b-ca05176d6b22"},{"id":"e725f778-1d94-11e8-8a9d-8d4c7b372557","created_at":"Thu Mar 01 22:01:30 UTC 2018","title":"Senior Software Developer","location":"Sydney","type":"Full Time","description":"<p>Expert360 is one of Australia's fastest growing startups. Our marketplace connects over 20,000 consultants to thousands of companies including several household names. Its not all suits and ties though as we pride ourselves on the diverse and creative team that builds the Expert360 platform and experience.</p>\n\n<p>We're looking for great people who have great ideas and know how to communicate them. As a member of our software engineering team you'll need to know how to code but we're not too fussed about exactly which languages you've used. We believe great developers do more than just code.</p>\n\n<p><strong>About the role</strong></p>\n\n<p>You'll work in multi-disciplinary \"squads\" alongside product managers and designers. Each day will start with a standup (you can dial in if you're remote) and will continue with coding, some product planning and maybe even some pairing with other developers.</p>\n\n<p>Our teams are empowered to work autonomously and encouraged to come up with initiatives themselves rather than have tasks set by management. And every few weeks you and your team-mates will have an opportunity to share your work with the whole company.</p>\n\n<p><strong>Is this person you?</strong></p>\n\n<ul>\n<li>You are a great communicator</li>\n<li>You are willing to share your ideas in an open setting</li>\n<li>You work well in teams</li>\n</ul><p><strong>Development Experience</strong></p>\n\n<p>If you have worked with any of the below we'd love to hear from you:</p>\n\n<ul>\n<li>Web development (particularly open source languages and frameworks)</li>\n<li>Databases</li>\n<li>Search systems</li>\n<li>Mobile Applications</li>\n<li>Scrum or Kanban</li>\n</ul><p><strong>Languages and Technology</strong></p>\n\n<p>We are big fans of Elixir, JavaScript and React. We also still give a nod to those little bits of PHP and Python that hang around the place.</p>","how_to_apply":"<p>Email your resume to <a href=\"mailto:steph@expert360.com\">steph@expert360.com</a></p>","company":"Expert360","company_url":"http://www.expert360.com/jobs","company_logo":null,"url":"http://jobs.github.com/positions/e725f778-1d94-11e8-8a9d-8d4c7b372557"},{"id":"ae60143a-0522-11e8-9172-cd964a422a37","created_at":"Thu Mar 01 21:49:39 UTC 2018","title":"Staff Site Reliability Engineer ","location":"North America","type":"Full Time","description":"<p>CircleCI is seeking a Staff Site Reliability Engineer to work closely with our Software Engineers to deliver and manage the high-performance and scalable infrastructure underlying our multi-tenant Cloud offering as well as our Server-installed, on-premises solution. You will not only have the chance to automate and optimize infrastructure through the construction of appropriate tooling, but you will help software engineers through the design phase to optimize their services for scale in our production environment.</p>\n\n<p>The CircleCI SRE team is globally distributed and remote-friendly. We take advantage of multiple timezones to manage a platform for our global customer base.</p>\n\n<p><b>About CircleCI</b></p>\n\n<ul>Velocity is critical for software teams in today's competitive landscape, but maintaining speed can be difficult as apps and systems grow larger and more complex. CircleCI’s platform allows developers to rapidly release code (for web and mobile apps) they trust by automating the build, test, and deploy process. CircleCI enables developers to detect and fix bugs before they even reach customers. Thousands of leading companies including Facebook, Kickstarter, Shyp and Spotify rely on CircleCI to accelerate delivery of their code and enable developers to focus on creating business value fast.</ul><p>CircleCI is a Bay Area Best Places to Work 2016 award winner. Founded in 2011 and headquartered in beautiful downtown San Francisco with a global remote workforce, CircleCI is venture backed by Scale Venture Partners, DFJ, Baseline Ventures and Harrison Metal Capital.</p>\n\n<p><b>What will make you successful:</b></p>\n\n<ul>\n<li>Experience managing a container-based microservice architecture, including orchestration, service-discovery, monitoring, and debugging</li>\n<li>Understanding of standard networking protocols and components such as: TCP/IP, HTTP, DNS, ICMP, the OSI Model, Subnetting, and Load Balancing</li>\n<li>In-depth knowledge of operating systems (processes, threads, IPC, concurrency, locks, mutexes, semaphores, etc.)</li>\n<li>Proficiency in one or more of: C, C++, Java, Python, Go</li>\n<li>Comprehensive knowledge of the internal workings of at least one of Postgres, Mongo, Redis</li>\n<li>Systematic problem solving approach, coupled with a strong sense of ownership and drive</li>\n<li>Track-record of working cooperatively with software engineering teams</li>\n<li>Focus on security in the delivery of all levels of a system</li>\n<li>Passion for modern software development and operation, including agile, CI/CD, and infrastructure-as-code</li>\n<li>Desire to learn and grow</li>\n<li>6+ years of experience</li>\n</ul><p><b>What you will do:</b></p>\n\n<ul>\n<li>Design and deliver solutions to improve the availability, scalability, latency, and efficiency of CircleCI’s services</li>\n<li>Engage in service capacity planning and demand forecasting, anticipating performance bottlenecks</li>\n<li>Diagnose and resolve production issues in conjunction with software engineering teams</li>\n<li>Architect and implement shared infrastructure used by all services within the CircleCI platform, for both SaaS and on-prem configurations</li>\n<li>Support and advise software engineering teams in the design of scalable services</li>\n<li>Build and maintain tools for deployment, monitoring, and debugging</li>\n<li>Plan and execute disaster recovery drills</li>\n<li>Participate in rotating on-call duties, including incident management</li>\n</ul><p>If you’re interested in joining the team at CircleCI, please send a resumé and let us know why you’d be a great fit for our team. If you contribute to an open source project, write a blog, or have a presence on the web (Twitter, GitHub, LinkedIn, etc.) we would love to hear about it.</p>\n\n<p>We care deeply about diversity and inclusivity. We’re hiring at all experience levels, and seek talented teammates from a wide variety of backgrounds and experiences who are equally committed to cultivating a work environment of respect and kindness. We carefully consider every applicant that takes the time to apply.</p>","how_to_apply":"<p><a href=\"https://jobs.lever.co/circleci/95b219a8-b490-4be0-9f03-daf40f00370f?lever-origin=applied&amp;lever-source%5B%5D=GITHUB\">https://jobs.lever.co/circleci/95b219a8-b490-4be0-9f03-daf40f00370f?lever-origin=applied&amp;lever-source%5B%5D=GITHUB</a></p>","company":"CircleCI","company_url":"http://www.circleci.com ","company_logo":"http://github-jobs.s3.amazonaws.com/5a549ca8-0522-11e8-9fed-bab2a9e6d40b.jpg","url":"http://jobs.github.com/positions/ae60143a-0522-11e8-9172-cd964a422a37"},{"id":"4b3e6b3c-1d95-11e8-98c6-ec3f34adce54","created_at":"Thu Mar 01 21:18:01 UTC 2018","title":"Senior Software Engineer","location":"Philadelphia","type":"Full Time","description":"<p><em>Full time, on-site in Philadelphia</em></p>\n\n<h2>About the position</h2>\n\n<p>As an engineer at PromptWorks, your responsibilities would include:</p>\n\n<ul>\n<li>Writing quality software for clients and providing them with technical direction</li>\n<li>Working well in a small team and independently when necessary</li>\n<li>Participating in daily stand up and weekly planning &amp; retrospective meetings</li>\n<li>Staying abreast of technology news, tools, and techniques</li>\n<li>Taking ownership of our work-product</li>\n</ul><p>Senior engineers have the following additional responsibilities:</p>\n\n<ul>\n<li>Interfacing directly with our clients, gathering their needs and managing their expectations</li>\n<li>Architecting, estimating and planning technical solutions to problems</li>\n<li>Mentoring other PromptWorks engineers and our clients' engineers</li>\n</ul><p>This is a Philadelphia-based position, and relocation assistance is available.</p>\n\n<h2>About the ideal candidate</h2>\n\n<p>We hire passionate, pragmatic, intelligent, well-spoken, knowledge-hungry, fun-loving people.</p>\n\n<p>You should have 5+ years of experience with the following:</p>\n\n<ul>\n<li>Ruby or Python</li>\n<li>A variety of web frameworks (preferably including Ruby on Rails, Flask, Django, Node.js)</li>\n<li>JavaScript</li>\n<li>Writing automated unit and feature tests</li>\n<li>Knowledge and appreciation of REST</li>\n<li>Deploying to and managing infrastructure on the cloud</li>\n<li>Git &amp; GitHub</li>\n<li>HTML, CSS</li>\n<li>Relational databases (e.g. PostgreSQL)</li>\n<li>Key/value stores (e.g. Redis)</li>\n<li>Bash, Linux</li>\n</ul><p>Experience with any of the following preferable:</p>\n\n<ul>\n<li>Deploying to and managing infrastructure on the cloud</li>\n<li>A variety of client-side JavaScript frameworks &amp; tools (preferably including Redux, Lodash, or Ember.js)</li>\n<li>Mobile development experience (iOS and Android)</li>\n<li>Contributing to open-source software projects</li>\n<li>Contributing to software communities by organizing or speaking at user groups, meetups or conferences</li>\n<li>Shell scripting</li>\n</ul><h2>We offer</h2>\n\n<ul>\n<li>R&amp;D time for internal projects, products, and professional development</li>\n<li>Paid travel for speaking at &amp; attending conferences</li>\n<li>Ergonomic work stations including seated &amp; standing pair programming stations</li>\n<li>100% company-paid medical, dental, life, and disability insurance</li>\n<li>401(k) plan with company matching</li>\n<li>Monthly work-from-home flexibility</li>\n<li>FSA and commuter benefits</li>\n<li>Collegial atmosphere with family-style lunch twice a week on us</li>\n<li>We value a healthy work-life balance, requiring about 30 billable hours per week</li>\n</ul><h2>Diversity</h2>\n\n<p>PromptWorks is made up of people with many different backgrounds and lifestyles. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other difference.</p>\n\n<h2>How to apply</h2>\n\n<p>Please apply with a custom cover letter. Tell us which position you’re applying for and why you’re a good fit. Please include a resume and examples of your work (e.g. links to code samples with descriptions). Submissions should be emailed to: <a href=\"mailto:SeniorEngineerJobs@promptworks.com?subject=%22ohai%20PromptWorks%20-%20Application%20for%20Senior%20Software%20Engineer%20%28Philadelphia%29%22\">SeniorEngineerJobs@promptworks.com</a></p>\n\n<p><em>Principals only. No recruiters, please.</em></p>","how_to_apply":"<p>Please apply with a custom cover letter. Tell us which position you’re applying for and why you’re a good fit. Please include a resume and examples of your work (e.g. links to code samples with descriptions). Submissions should be emailed to <a href=\"mailto:SeniorEngineerJobs@promptworks.com?subject=%22ohai%20PromptWorks%20-%20Application%20for%20Senior%20Software%20Engineer%20%28Philadelphia%29%22\">SeniorEngineerJobs@promptworks.com</a></p>","company":"PromptWorks","company_url":"https://www.promptworks.com/jobs/","company_logo":"http://github-jobs.s3.amazonaws.com/c09edc10-1d93-11e8-94af-457d96d69f44.png","url":"http://jobs.github.com/positions/4b3e6b3c-1d95-11e8-98c6-ec3f34adce54"},{"id":"29b03502-1d8d-11e8-9ade-ee1a68f91e66","created_at":"Thu Mar 01 20:14:36 UTC 2018","title":"Senior Software Engineer, Server Side Technologies","location":"New York, NY, US","type":"Full Time","description":"<p></p><p>“Jun” means truth, and our culture is all about openness and honesty. This is a place where individuals are heard, diverse perspectives are encouraged, and the CEO makes time to take everyone to lunch, one and two at a time. It’s a place where we ask every engineer to spend part of their time going beyond our strategy, to show us their own.</p><p>When you work here you develop on the national stage, reaching tens of millions of users around the world, thousands of times a second, every day. Our technology is integrated into the world’s most popular apps and sites. Our clients are household names: Coke, Conde-Nast, Frito-Lay, McDonald's, etc.</p><p><strong>Requirements/Responsibilities</strong></p><ul>\n<li>Work on high-scale, modern cloud-hosted services in JRuby</li>  <li>You’re comfortable multi-tasking and dealing with deadlines</li>  <li>Code reviews</li>   <li>Web development using HTML5, CSS and JavaScript</li>\n</ul><p><strong>Working Environment</strong></p><ul>\n<li>Kanban workflow</li>    <li>Experienced co-workers</li> <li>Emphasis on code quality</li>   <li>Unit, functional, and integration testing</li> <li>On staff QA team</li>\n</ul><p><strong>Additional Beneficial Skills and Experience</strong></p><ul>\n<li>Git</li>    <li>Ruby/Rails</li> <li>Scala/Play</li> <li>JavaScript</li> <li>IntelliJ IDEA / Teamcity</li>   <li>JIRA</li>   <li>AWS (EC2, Cloudfront, ELB)</li> <li>Google Cloud (BiqQuery, Dataflow)</li>  <li>Heroku</li> <li>MySQL</li>\n</ul><p>Total compensation is based on experience; excellent benefits, conference/training budget. We welcome diversity and non-traditional paths into engineering, and advocate strongly for hiring the right person as opposed to the right combination of tech keywords.</p><p>If this sounds like a fit, drop us a line. No recruiters or other 3rd parties please!</p> <img src=\"https://www.applytracking.com/track.aspx/7cj97\">","how_to_apply":"<p><a href=\"https://www.applytracking.com/track.aspx/7cj9H\">https://www.applytracking.com/track.aspx/7cj9H</a></p>","company":"Jun Group","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/29b03502-1d8d-11e8-9ade-ee1a68f91e66"},{"id":"227da200-1d89-11e8-83b8-e9e581c96a2e","created_at":"Thu Mar 01 19:47:00 UTC 2018","title":"WordPress Developer","location":"Washington, DC","type":"Full Time","description":"<p>Join our team of experienced developers building best-in-class WordPress applications that power our client’s websites, reaching millions of people a year.</p>\n\n<p>Threespot WordPress developers transform the web’s most ubiquitous blogging platform into a sophisticated content management system, capable of meeting the needs of any organization. By applying modern best practices, they make WordPress as performant and secure as any rival CMS. They are experts in their field, but always open to new ideas. They thrive on variety and welcome new challenges. They are well rounded and can speak to UX and design challenges. They want to work for clients who are making a difference, not just a profit.</p>\n\n<p><strong>Requirements</strong></p>\n\n<ul>\n<li>A minimum of two full years of experience working with PHP and WordPress on production applications, including an understanding of MySQL, core WordPress functions, custom post types, custom themes/plugins, and integration best practices</li>\n<li>Comfortable writing front-end code that’s responsive, cross-browser compatible, and maintainable</li>\n<li>Familiar with Sass or similar CSS preprocessors (e.g., Less, Stylus, PostCSS)</li>\n<li>Familiar with modern JavaScript libraries and frameworks (e.g., React, Vue, or Angular)</li>\n<li>Familiar with accessibility standards (e.g., WCAG or Section 508)</li>\n<li>Comfortable with Git and GitHub</li>\n<li>We are a highly collaborative company working to solve a range of client problems as a team. As a result this is a full-time position, on-site in our DC offices. Remote work, part-time or contract workers will not be considered.</li>\n</ul><p><strong>Responsibilities</strong></p>\n\n<ul>\n<li>Develop content-focused WordPress sites with an emphasis on performance and security</li>\n<li>Develop efficient, maintainable, and scalable front-end systems</li>\n<li>Advise User Experience and Design leads on the technical viability of functionality and designs</li>\n<li>Maintain regular communication with Client Services team around scheduling and scope</li>\n<li>Capable of translating user and business needs into technical requirements and content structures</li>\n<li>Produce thorough estimates for potential work</li>\n</ul><p><strong>Bonus Points</strong></p>\n\n<ul>\n<li>Familiarity with Platform.sh, Pantheon, Heroku, Docker, Amazon Web Services, or other relevant DevOps experience</li>\n<li>Familiarity with Composer, Advanced Custom Fields, Bedrock, Sage, or Lando</li>\n<li>Experience working on HTTPS/TLS websites and site certificates</li>\n<li>Familiarity with Node.js and npm</li>\n<li>Familiarity with Ruby and the Ruby on Rails framework, or other MVC frameworks (Laravel, Phoenix, Django, etc.)</li>\n<li>Experience using test-driven development practices</li>\n<li>Design, information architecture, or user-experience work</li>\n</ul><p><strong>Benefits</strong></p>\n\n<ul>\n<li>Immediate eligibility for paid time off</li>\n<li>Medical, dental and vision insurance</li>\n<li>401k with employer match</li>\n<li>Commuter benefits (including SmartBenefits and Capital Bikeshare)</li>\n<li>Monthly gym membership stipend</li>\n<li>Parental leave</li>\n<li>Short- and long-term disability leave</li>\n</ul><p>Apply via our website: <a href=\"https://www.threespot.com/jobs/wordpress-developer\">threespot.com</a></p>","how_to_apply":"<p>Apply via our website: <a href=\"https://www.threespot.com/jobs/wordpress-developer\">https://www.threespot.com/jobs/wordpress-developer</a></p>","company":"Threespot","company_url":"https://www.threespot.com/","company_logo":"http://github-jobs.s3.amazonaws.com/f4a4fd24-1d88-11e8-9cac-f55cc20eee61.png","url":"http://jobs.github.com/positions/227da200-1d89-11e8-83b8-e9e581c96a2e"},{"id":"7cc6a1c0-1d85-11e8-8239-638eb8f8deac","created_at":"Thu Mar 01 19:19:52 UTC 2018","title":"Software Engineer (Python, Java, C++, or PHP)","location":"New York","type":"Full Time","description":"<p>Who We Are:</p>\n\n<p>BlindData is an innovative platform built to identify the very best programmers using our proprietary standardized testing. Designed by award-winning programmers as well as distinguished professors at top computer science universities, our technology-driven approach utilizes adaptive multiple choice and coding tests to uniformly assess software engineering knowledge and ability. Our exams test for advanced logical thinking, complex programming skills and performance potential. </p>\n\n<p>What We Do:</p>\n\n<p>We have developed the \"SATs\" for software engineers. Our mission is to eliminate unnecessary bias within hiring processes through rigorous assessment methods in JAVA, Python, C++ and PHP. Candidates that make it through our testing and screening process are among the top programmers on the market. With thousands of BlindData Candidates, we can quickly optimize the tech hiring process for companies both large and small. </p>\n\n<p>What You’ll Do:\nCollaborate with our testing problem contributors to author, edit and deploy coding challenges on our platform.\nConstantly enhance platform performance and help scale our system as we grow.\nCreate experiences for app and web environments. \nPartner with Lead Developer and CTO on various projects.\nManage individual project priorities, deadlines and deliverables. \nMaintain and iterate on company website and overall user experience for candidates and partners.\nWork on a small, agile and growing team to help us build out the business and expand our user base.</p>\n\n<p>Who You Are:</p>\n\n<p>Applicants should be highly skilled in one of Python, C++, Java, PHP. We are a small but growing company looking to hire top technical talent.</p>\n\n<p>If you are interested in applying, visit <a href=\"http://www.blinddata.com/r/handshake\">www.blinddata.com/r/handshake</a> and click on “Test your Talents!” to take our 20-minute online challenge. It’s as easy as that! This fast and free evaluation will help us assess your fit for applicable roles within our company. Your online challenge score will determine if you are invited to the final round which consists of an in-person exam. After that point, you will become BlindData Certified and be considered for open roles on our team. </p>\n\n<p>Minimum Qualifications:\nCoding experience in Java, Python, C++, PHP\nHave experience with API design\nHave experience with AWS services\nHave experience with frontend frameworks\nExceptional distributed systems programming skills\nFamiliarity with SQL and databases</p>\n\n<p>Preferred Qualifications:\nExperience with financial software, especially within Fixed Income and financial broker/exchange APIs (e.g. price feeds, order execution) a plus\nExperience with real-time distributed systems and fast-cycle version iterations\nDegree in Computer Science or related field</p>","how_to_apply":"<p>Visit <a href=\"http://www.blinddata.com/r/GitHub\">http://www.blinddata.com/r/GitHub</a> and take the online challenge.</p>","company":"BlindData","company_url":"http://www.blinddata.com/r/GitHub","company_logo":"http://github-jobs.s3.amazonaws.com/e6a644f2-1d84-11e8-880b-54781af03e15.png","url":"http://jobs.github.com/positions/7cc6a1c0-1d85-11e8-8239-638eb8f8deac"},{"id":"7a53c45e-1d80-11e8-99de-b3bd119ceb16","created_at":"Thu Mar 01 18:44:44 UTC 2018","title":"Server-Side Engineer","location":"Portland, Oregon","type":"Full Time","description":"<p>About the job: Tozny is hiring an engineer for a complex and creative multi-year health care data project. We are looking for someone to help us extend the capabilities of our existing end-to-end encrypted database product (E3DB). You will work closely with the Tozny team to deliver timely and secure product features for E3DB.</p>\n\n<p>Required Characteristics (1-2 years):</p>\n\n<p>You’re an excellent functional programmer in a modern language, preferably Scala.</p>\n\n<p>You thrive in a collaborative work environment and can be trusted with important responsibilities.</p>\n\n<p>You have experienced the pros and cons of working with a microservice architecture and can make tasteful trade-off decisions about web APIs.</p>\n\n<p>You are comfortable with Unix based development on Linux or MacOS, including experience with the command line environment.</p>\n\n<p>You have developed applications with SQL-based storage systems like Postgres.</p>\n\n<p>You collaborate with other developers with standard tools, particularly distributed systems like Git and project management systems like Jira.</p>\n\n<p>Desired Experience:</p>\n\n<p>Container based development and deployment environment</p>\n\n<p>Quality assurance and testing activities including automated unit / integration testing</p>\n\n<p>Additional experience in languages like Java, PHP, JavaScript, Go, Ruby, Python, or C</p>\n\n<p>Applied cryptography, practical security, and a focus on privacy</p>\n\n<p>Compliance frameworks like GDPR, FIPPs, HIPAA, or NIST 800 series\nMobile software development in Android or iOS</p>\n\n<p>DevOps, and particularly robust AWS environments</p>\n\n<p>Agile project development</p>\n\n<p>Mission: Here at Tozny, we’re passionate about the security and privacy of everyday users. We build toolkits for developers in a collaborative and positive environment. Join us, and help fix some of the biggest problems in computer security and privacy. We’re a spinoff of Galois, the security research firm. Our pay and benefits are in line with the industry, including an employer-funded health plan, 401(k), and stock option pool. Our office is located downtown, with multiple transportation routes to the office and a bike garage.</p>\n\n<p>We value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n\n<p>About Portland, Oregon: We’re located in the heart of one of the best cities in America. It has excellent restaurants, tons of brew pubs, it’s artistic, literate, and bike friendly. Hike nearby in the Columbia River Gorge, ski on Mt. Hood, or take in the vistas and Pinot Noirs in our world-renowned wine country.</p>","how_to_apply":"<p>Apply  online at <a href=\"https://tozny1.hiringthing.com/job/62757/server-side-engineer?s=github\">https://tozny1.hiringthing.com/job/62757/server-side-engineer?s=github</a></p>","company":"Tozny","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/5c72ddee-1d80-11e8-9483-3c1b4bd6f67e.png","url":"http://jobs.github.com/positions/7a53c45e-1d80-11e8-99de-b3bd119ceb16"},{"id":"ffb02148-1d70-11e8-90a8-395ba88c547c","created_at":"Thu Mar 01 16:53:26 UTC 2018","title":"Multiple Senior Software Engineer Positions","location":"Memphis, TN","type":"Full Time","description":"<p>The World’s Most Dedicated Never Give Up</p>\n\n<p>There’s a reason St. Jude Children’s Research Hospital is consistently ranked on Fortune Magazine’s “100 Best Places to Work For” list. Because at our world-class pediatric research hospital, every one of our professionals shares our commitment to make a difference in the lives of the children we serve. There’s a unique bond when you’re part of a team that gives their all to advance the treatments and cures of pediatric catastrophic diseases. The result is a collaborative, positive environment where everyone, regardless of their role, receives the resources, support and encouragement to advance and grow their careers and be the force behind the cures.  </p>\n\n<p>Multiple Senior Software Engineer Positions\nMemphis, TN</p>\n\n<p>Overview</p>\n\n<p>The department of Computational Biology is seeking highly motivated and creative Senior Software Engineers to develop software used in big data bioinformatics analysis as part of a team of scientists and engineers at the forefront of genomic research into catastrophic childhood diseases. Positions are available in the following focus areas:</p>\n\n<ul>\n<li>Developing big data processing capabilities for the St. Jude Cloud project. Primary responsibilities will be the oversight and development of the St. Jude Cloud Data Transfer Application, creating and maintaining processes for uploading petabyte-scale data to St. Jude Cloud, and oversight and implementation of all genomic data products in St. Jude Cloud. Knowledge of Linux, Bash, Git, and at least one of the following languages is required: Javascript, NodeJS, Python. Experience in VueJS, ElectronJS, Webpack, technical leadership on software development projects, software product design, and common cloud computing paradigms is preferred.</li>\n<li>Developing and maintaining advanced bioinformatics tools for the St. Jude Cloud project. Primary responsibilities will be developing and publishing bioinformatics tools in St. Jude Cloud, pioneering the implementation of new workflow technologies at St. Jude, and oversight and implementation of all genomic tools products in St. Jude Cloud. Knowledge of Linux, Bash, Git, Python, and at least one of the following languages is required: Java, Perl, C, C++, Go, Rust. Experience in workflow languages (WDL/CWL/NextFlow), containerization (Docker), technical leadership on software development projects, software product design, common cloud computing paradigms is preferred.</li>\n<li>Developing and maintaining advanced bioinformatics tools in St. Jude’s high-performance computing (HPC) environment. Primary responsibilities will be development of software infrastructure supporting large-scale automation, and bioinformatics pipeline evaluation and development.  Knowledge of Bash and Perl or Python is required.  Must be able to work with complex large-scale systems, including legacy and externally developed code.  Experience in a bioinformatics or big data setting is preferred.</li>\n</ul><p>All positions listed require experience working within a team of software developers, writing and maintaining documentation relevant to the position’s scope of work, writing and maintaining unit tests for software, and assisting in preparing and submitting manuscripts. When applying, please include areas of specific interest in cover letter.</p>\n\n<p>Recognized as a world leader in mapping the genetic landscape of pediatric cancers, the St. Jude department of Computational Biology has developed state-of-art computational infrastructure, well-established analytical pipelines, and deep genomic analysis expertise with a track record of high-impact publications in top-tier biomedical journals such as Nature, NEJM, JAMA, Nature Genetics, and Nature Methods. The department provides a highly interactive environment with collaborative opportunities across basic and clinical departments, access to high performance computing clusters, cloud computing environment, innovative visualization tools, highly automated analytical pipelines and mentorship from faculty scientists with deep experience in data analysis, data management, and delivery of high-quality results for highly competitive projects. This position is located in Memphis, TN, and relocation assistance is available.</p>\n\n<p>Minimum Experience</p>\n\n<ul>\n<li>Five (5) years of experience in software development is required. One year of experience required with a Master's degree.</li>\n<li>Linux experience is required.</li>\n<li>Must be able to develop software in at least one of the following programming languages used within the department: Perl, Python, Linux shell scripting, or Java.</li>\n<li>Database development and SQL experience is preferred</li>\n<li>Experience in working with large data sets or bioinformatics data is preferred. </li>\n<li>Familiarity with statistical analysis methods and languages such as R is preferred.</li>\n<li>Experience in a research or academic setting preferred.</li>\n</ul><p>Minimum Education</p>\n\n<ul>\n<li>Bachelor's degree in engineering, computer science, physical science, or related field required.</li>\n<li>Master's degree is preferred.</li>\n</ul><p>Ready to join a team that stops at nothing, because we believe anything is possible? </p>\n\n<p>Apply now at: <a href=\"http://bit.ly/2FIaH4S\">http://bit.ly/2FIaH4S</a></p>\n\n<p>St. Jude Children’s Research Hospital is an Equal Opportunity Employer. St. Jude does not discriminate on the basis of race, national origin, sex, genetic information, age, religion, disability, sexual orientation, gender identity, transgender status, veteran’s status or disabled veteran’s status with respect to employment opportunities.  All qualified applicants will be considered for employment.  St. Jude engages in affirmative action to increase employment opportunities for minorities, women, veterans and individuals with disabilities.</p>","how_to_apply":"<p><a href=\"http://bit.ly/2FIaH4S\">http://bit.ly/2FIaH4S</a></p>","company":"St. Jude Children's Research Hospital","company_url":"https://www.stjude.org/","company_logo":null,"url":"http://jobs.github.com/positions/ffb02148-1d70-11e8-90a8-395ba88c547c"},{"id":"15a1bd48-10da-11e8-8dd7-7617cf12b322","created_at":"Thu Mar 01 16:22:28 UTC 2018","title":"Full Stack Developer","location":"Amsterdam","type":"Full Time","description":"<p>Booking.com is looking for Full Stack Developers all around the globe!  Join us in our beautiful Amsterdam headquarters and work on planet Earth’s #1 accommodation website with the industry’s smartest people! Our guiding principle is that by helping users we help our business </p>\n\n<p>B.Responsible </p>\n\n<p>As a Full Stack Developer, you are responsible for developing world-class, complete web applications, both on the backend and frontend, for monitoring and addressing performance and security, and for developing customer-focused and scalable user experiences. You will work side-by-side with designers, product owners, copywriters and other developers to create new features, test your own ideas, and push changes live for billions of users. You will:</p>\n\n<p>Deliver web applications from an idea inception and validation to a scalable solution.\nCollaborate with colleagues to ideate solutions for users, prioritizing based on business impact, and A/B test them.\nDevelop new user-facing products and optimize existing ones using both client-side as well as server-side languages and technologies</p>\n\n<p>B.Skilled  </p>\n\n<p>Understanding the full stack of web development, from transmission of data segments between networks to presenting a well-strategized experience to users is vitally important in this role. We need self-starters who are great at solving problems, who initiate discussions, are solutions-oriented, customer focused and believe that any challenge can be scaled with the right mindset and tools. We are looking for:</p>\n\n<ul>\n<li>Experience working on products that impact a large user base or in an entrepreneurial startup environment.</li>\n<li>Experience with data-driven product development: analytics, A/B testing, etc.</li>\n<li>Self-starters with a collaborative, “can-do” attitude.</li>\n<li>Quick delivery of end-to-end solutions to validate ideas and produce quality products</li>\n<li>A minimum of 3 years of experience with one or more general purpose programming languages, including but not limited to: Perl, Java, Python, Scala, C++ and Web development with JavaScript, HTML, CSS and HTTP.</li>\n<li>Experience debugging cross-browser compatibility issues.</li>\n<li>Experience  working on a command line in a Linux environment.</li>\n<li>Passionate learners who aren’t afraid of new tools and technologies to build a great end-to-end customer experience.</li>\n</ul><p>B.Offered  </p>\n\n<p>We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We offer what we call the “Booking Deal” with other competitive perks and benefits. We have tech talks, trainings, and support you attending and speaking at global conferences.</p>\n\n<p>This position is open to worldwide candidates and, in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We successfully relocate hundreds of IT professionals and their families to Amsterdam every year. Join us! </p>\n\n<p>The hiring company Booking.com BV is the company behind Booking.com™, the market leading online accommodation reservation service in the world. Booking.com BV is looking for a Full Stack Developer in Amsterdam, the Netherlands. All references to “Booking.com\" refer to Booking.com BV.</p>","how_to_apply":"<p><a href=\"http://grnh.se/r2jl401\">Apply Here</a></p>","company":"Booking.com BV","company_url":"http://booking.https://www.booking.com/com","company_logo":"http://github-jobs.s3.amazonaws.com/1342edf6-10da-11e8-8619-ab2c699d2704.jpg","url":"http://jobs.github.com/positions/15a1bd48-10da-11e8-8dd7-7617cf12b322"},{"id":"db9ef0f4-bfe7-11e7-98d4-d371577aa6c0","created_at":"Thu Mar 01 16:22:28 UTC 2018","title":"Full Stack Developer","location":"Amsterdam, the Netherlands","type":"Full Time","description":"<p>Job Description:</p>\n\n<p>Booking.com is looking for Full Stack Developers all around the globe!  Join us in our beautiful Amsterdam headquarters and work on planet Earths #1 accommodation website with the industry's smartest people! Our guiding principle is that by helping users we help our business. </p>\n\n<p><strong>B.Responsible</strong></p>\n\n<p>As a Full Stack Developer, you are responsible for developing world-class, complete web applications, both on the backend and frontend, for monitoring and addressing performance and security, and for developing customer-focused and scalable user experiences. You will work side-by-side with designers, product owners, copywriters and other developers to create new features, test your own ideas, and push changes live for billions of users. </p>\n\n<p>You will:</p>\n\n<p>Deliver web applications from an idea inception and validation to a scalable solution.\nCollaborate with colleagues to ideate solutions for users, prioritizing based on business impact, and A/B test them.</p>\n\n<p>Develop new user-facing products and optimize existing ones using both client-side as well as server-side languages and technologies.</p>\n\n<p><strong>B.Skilled</strong></p>\n\n<p>Understanding the full stack of web development, from transmission of data segments between networks to presenting a well-strategized experience to users is vitally important in this role. We need self-starters who are great at solving problems, who initiate discussions, are solutions-oriented, customer focused and believe that any challenge can be scaled with the right mindset and tools. </p>\n\n<p>We are looking for:</p>\n\n<ul>\n<li>Experience working on products that impact a large user base or in an entrepreneurial startup environment.</li>\n<li>Experience with data-driven product development: analytics, A/B testing, etc.</li>\n<li>Self-starters with a collaborative, can-do attitude.</li>\n<li>Quick delivery of end-to-end solutions to validate ideas and produce quality products.</li>\n<li>A minimum of 3 years of experience with one or more general purpose programming languages, including but not limited to: Perl, Java, Python, Scala, C++ and Web development with JavaScript, HTML, CSS and HTTP.</li>\n<li>Experience debugging cross-browser compatibility issues.</li>\n<li>Experience  working on a command line in a Linux environment.</li>\n<li>Passionate learners who arent afraid of new tools and technologies to build a great end-to-end customer experience.</li>\n</ul><p><strong>B.Offered</strong></p>\n\n<p>We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We offer what we call the Booking Deal with other competitive perks and benefits. We have tech talks, trainings, and support you attending and speaking at global conferences.</p>\n\n<p>This position is open to worldwide candidates and, in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We successfully relocate hundreds of IT professionals and their families to Amsterdam every year. Join us!</p>","how_to_apply":"<p>Apply here: <a href=\"https://goo.gl/Axo3Lc\">https://goo.gl/Axo3Lc</a></p>","company":"Booking.com BV","company_url":"https://www.booking.com/","company_logo":"http://github-jobs.s3.amazonaws.com/d8c7bb04-bfe7-11e7-9a4a-7b76a32c6bdb.jpg","url":"http://jobs.github.com/positions/db9ef0f4-bfe7-11e7-98d4-d371577aa6c0"}]